konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/dma.inc
# -----------------------------------------------------------------------------
# Field       : DMA_CH4_CTRL_TRIG_RING_SEL
# Description : Select whether RING_SIZE applies to read or write addresses.
#               If 0, read addresses are wrapped on a (1 << RING_SIZE)
#               boundary. If 1, write addresses are wrapped.
.equ	DMA_CH4_CTRL_TRIG_RING_SEL_RESET, 0x0
.equ	DMA_CH4_CTRL_TRIG_RING_SEL_BITS, 0x00001000
.equ	DMA_CH4_CTRL_TRIG_RING_SEL_MSB, 12
.equ	DMA_CH4_CTRL_TRIG_RING_SEL_LSB, 12
# -----------------------------------------------------------------------------
# Field       : DMA_CH4_CTRL_TRIG_RING_SIZE
# Description : Size of address wrap region. If 0, don't wrap. For values n >
#               0, only the lower n bits of the address will change. This wraps
#               the address on a (1 << n) byte boundary, facilitating access to
#               naturally-aligned ring buffers.
#
#               Ring sizes between 2 and 32768 bytes are possible. This can
#               apply to either read or write addresses, based on value of
#               RING_SEL.
#               0x0 -> RING_NONE
.equ	DMA_CH4_CTRL_TRIG_RING_SIZE_RESET, 0x0
.equ	DMA_CH4_CTRL_TRIG_RING_SIZE_BITS, 0x00000f00
.equ	DMA_CH4_CTRL_TRIG_RING_SIZE_MSB, 11
.equ	DMA_CH4_CTRL_TRIG_RING_SIZE_LSB, 8
.equ	DMA_CH4_CTRL_TRIG_RING_SIZE_VALUE_RING_NONE, 0x0
# -----------------------------------------------------------------------------
# Field       : DMA_CH4_CTRL_TRIG_INCR_WRITE_REV
# Description : If 1, and INCR_WRITE is 1, the write address is decremented
#               rather than incremented with each transfer.
#
#               If 1, and INCR_WRITE is 0, this otherwise-unused combination
#               causes the write address to be incremented by twice the
#               transfer size, i.e. skipping over alternate addresses.
.equ	DMA_CH4_CTRL_TRIG_INCR_WRITE_REV_RESET, 0x0
.equ	DMA_CH4_CTRL_TRIG_INCR_WRITE_REV_BITS, 0x00000080
.equ	DMA_CH4_CTRL_TRIG_INCR_WRITE_REV_MSB, 7
.equ	DMA_CH4_CTRL_TRIG_INCR_WRITE_REV_LSB, 7
# -----------------------------------------------------------------------------
# Field       : DMA_CH4_CTRL_TRIG_INCR_WRITE
# Description : If 1, the write address increments with each transfer. If 0,
#               each write is directed to the same, initial address.
#
#               Generally this should be disabled for memory-to-peripheral
#               transfers.
.equ	DMA_CH4_CTRL_TRIG_INCR_WRITE_RESET, 0x0
.equ	DMA_CH4_CTRL_TRIG_INCR_WRITE_BITS, 0x00000040
.equ	DMA_CH4_CTRL_TRIG_INCR_WRITE_MSB, 6
.equ	DMA_CH4_CTRL_TRIG_INCR_WRITE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : DMA_CH4_CTRL_TRIG_INCR_READ_REV
# Description : If 1, and INCR_READ is 1, the read address is decremented
#               rather than incremented with each transfer.
#
#               If 1, and INCR_READ is 0, this otherwise-unused combination
#               causes the read address to be incremented by twice the transfer
#               size, i.e. skipping over alternate addresses.
.equ	DMA_CH4_CTRL_TRIG_INCR_READ_REV_RESET, 0x0
.equ	DMA_CH4_CTRL_TRIG_INCR_READ_REV_BITS, 0x00000020
.equ	DMA_CH4_CTRL_TRIG_INCR_READ_REV_MSB, 5
.equ	DMA_CH4_CTRL_TRIG_INCR_READ_REV_LSB, 5
# -----------------------------------------------------------------------------
# Field       : DMA_CH4_CTRL_TRIG_INCR_READ
# Description : If 1, the read address increments with each transfer. If 0,
#               each read is directed to the same, initial address.
#
#               Generally this should be disabled for peripheral-to-memory
#               transfers.
.equ	DMA_CH4_CTRL_TRIG_INCR_READ_RESET, 0x0
.equ	DMA_CH4_CTRL_TRIG_INCR_READ_BITS, 0x00000010
.equ	DMA_CH4_CTRL_TRIG_INCR_READ_MSB, 4
.equ	DMA_CH4_CTRL_TRIG_INCR_READ_LSB, 4
# -----------------------------------------------------------------------------
# Field       : DMA_CH4_CTRL_TRIG_DATA_SIZE
# Description : Set the size of each bus transfer (byte/halfword/word).
#               READ_ADDR and WRITE_ADDR advance by this amount (1/2/4 bytes)
#               with each transfer.
#               0x0 -> SIZE_BYTE
#               0x1 -> SIZE_HALFWORD
#               0x2 -> SIZE_WORD
.equ	DMA_CH4_CTRL_TRIG_DATA_SIZE_RESET, 0x0
.equ	DMA_CH4_CTRL_TRIG_DATA_SIZE_BITS, 0x0000000c
.equ	DMA_CH4_CTRL_TRIG_DATA_SIZE_MSB, 3
.equ	DMA_CH4_CTRL_TRIG_DATA_SIZE_LSB, 2
.equ	DMA_CH4_CTRL_TRIG_DATA_SIZE_VALUE_SIZE_BYTE, 0x0
.equ	DMA_CH4_CTRL_TRIG_DATA_SIZE_VALUE_SIZE_HALFWORD, 0x1
.equ	DMA_CH4_CTRL_TRIG_DATA_SIZE_VALUE_SIZE_WORD, 0x2
# -----------------------------------------------------------------------------
# Field       : DMA_CH4_CTRL_TRIG_HIGH_PRIORITY
# Description : HIGH_PRIORITY gives a channel preferential treatment in issue
#               scheduling: in each scheduling round, all high priority
#               channels are considered first, and then only a single low
#               priority channel, before returning to the high priority
#               channels.
#
#               This only affects the order in which the DMA schedules
#               channels. The DMA's bus priority is not changed. If the DMA is
#               not saturated then a low priority channel will see no loss of
#               throughput.
.equ	DMA_CH4_CTRL_TRIG_HIGH_PRIORITY_RESET, 0x0
.equ	DMA_CH4_CTRL_TRIG_HIGH_PRIORITY_BITS, 0x00000002
.equ	DMA_CH4_CTRL_TRIG_HIGH_PRIORITY_MSB, 1
.equ	DMA_CH4_CTRL_TRIG_HIGH_PRIORITY_LSB, 1
# -----------------------------------------------------------------------------
# Field       : DMA_CH4_CTRL_TRIG_EN
# Description : DMA Channel Enable.
#               When 1, the channel will respond to triggering events, which
#               will cause it to become BUSY and start transferring data. When
#               0, the channel will ignore triggers, stop issuing transfers,
#               and pause the current transfer sequence (i.e. BUSY will remain
#               high if already high)
.equ	DMA_CH4_CTRL_TRIG_EN_RESET, 0x0
.equ	DMA_CH4_CTRL_TRIG_EN_BITS, 0x00000001
.equ	DMA_CH4_CTRL_TRIG_EN_MSB, 0
.equ	DMA_CH4_CTRL_TRIG_EN_LSB, 0
# =============================================================================
# Register    : DMA_CH4_AL1_CTRL
# Description : Alias for channel 4 CTRL register
.equ	DMA_CH4_AL1_CTRL_OFFSET, 0x00000110
.equ	DMA_CH4_AL1_CTRL_BITS, 0xffffffff
.equ	DMA_CH4_AL1_CTRL_MSB, 31
.equ	DMA_CH4_AL1_CTRL_LSB, 0
# =============================================================================
# Register    : DMA_CH4_AL1_READ_ADDR
# Description : Alias for channel 4 READ_ADDR register
.equ	DMA_CH4_AL1_READ_ADDR_OFFSET, 0x00000114
.equ	DMA_CH4_AL1_READ_ADDR_BITS, 0xffffffff
.equ	DMA_CH4_AL1_READ_ADDR_MSB, 31
.equ	DMA_CH4_AL1_READ_ADDR_LSB, 0
# =============================================================================
# Register    : DMA_CH4_AL1_WRITE_ADDR
# Description : Alias for channel 4 WRITE_ADDR register
.equ	DMA_CH4_AL1_WRITE_ADDR_OFFSET, 0x00000118
.equ	DMA_CH4_AL1_WRITE_ADDR_BITS, 0xffffffff
.equ	DMA_CH4_AL1_WRITE_ADDR_MSB, 31
.equ	DMA_CH4_AL1_WRITE_ADDR_LSB, 0
# =============================================================================
# Register    : DMA_CH4_AL1_TRANS_COUNT_TRIG
# Description : Alias for channel 4 TRANS_COUNT register
#               This is a trigger register (0xc). Writing a nonzero value will
#               reload the channel counter and start the channel.
.equ	DMA_CH4_AL1_TRANS_COUNT_TRIG_OFFSET, 0x0000011c
.equ	DMA_CH4_AL1_TRANS_COUNT_TRIG_BITS, 0xffffffff
.equ	DMA_CH4_AL1_TRANS_COUNT_TRIG_MSB, 31
.equ	DMA_CH4_AL1_TRANS_COUNT_TRIG_LSB, 0
# =============================================================================
# Register    : DMA_CH4_AL2_CTRL
# Description : Alias for channel 4 CTRL register
.equ	DMA_CH4_AL2_CTRL_OFFSET, 0x00000120
.equ	DMA_CH4_AL2_CTRL_BITS, 0xffffffff
.equ	DMA_CH4_AL2_CTRL_MSB, 31
.equ	DMA_CH4_AL2_CTRL_LSB, 0
# =============================================================================
# Register    : DMA_CH4_AL2_TRANS_COUNT
# Description : Alias for channel 4 TRANS_COUNT register
.equ	DMA_CH4_AL2_TRANS_COUNT_OFFSET, 0x00000124
.equ	DMA_CH4_AL2_TRANS_COUNT_BITS, 0xffffffff
.equ	DMA_CH4_AL2_TRANS_COUNT_MSB, 31
.equ	DMA_CH4_AL2_TRANS_COUNT_LSB, 0
# =============================================================================
# Register    : DMA_CH4_AL2_READ_ADDR
# Description : Alias for channel 4 READ_ADDR register
.equ	DMA_CH4_AL2_READ_ADDR_OFFSET, 0x00000128
.equ	DMA_CH4_AL2_READ_ADDR_BITS, 0xffffffff
.equ	DMA_CH4_AL2_READ_ADDR_MSB, 31
.equ	DMA_CH4_AL2_READ_ADDR_LSB, 0
# =============================================================================
# Register    : DMA_CH4_AL2_WRITE_ADDR_TRIG
# Description : Alias for channel 4 WRITE_ADDR register
#               This is a trigger register (0xc). Writing a nonzero value will
#               reload the channel counter and start the channel.
.equ	DMA_CH4_AL2_WRITE_ADDR_TRIG_OFFSET, 0x0000012c
.equ	DMA_CH4_AL2_WRITE_ADDR_TRIG_BITS, 0xffffffff
.equ	DMA_CH4_AL2_WRITE_ADDR_TRIG_MSB, 31
.equ	DMA_CH4_AL2_WRITE_ADDR_TRIG_LSB, 0
# =============================================================================
# Register    : DMA_CH4_AL3_CTRL
# Description : Alias for channel 4 CTRL register
.equ	DMA_CH4_AL3_CTRL_OFFSET, 0x00000130
.equ	DMA_CH4_AL3_CTRL_BITS, 0xffffffff
.equ	DMA_CH4_AL3_CTRL_MSB, 31
.equ	DMA_CH4_AL3_CTRL_LSB, 0
# =============================================================================
# Register    : DMA_CH4_AL3_WRITE_ADDR
# Description : Alias for channel 4 WRITE_ADDR register
.equ	DMA_CH4_AL3_WRITE_ADDR_OFFSET, 0x00000134
.equ	DMA_CH4_AL3_WRITE_ADDR_BITS, 0xffffffff
.equ	DMA_CH4_AL3_WRITE_ADDR_MSB, 31
.equ	DMA_CH4_AL3_WRITE_ADDR_LSB, 0
# =============================================================================
# Register    : DMA_CH4_AL3_TRANS_COUNT
# Description : Alias for channel 4 TRANS_COUNT register
.equ	DMA_CH4_AL3_TRANS_COUNT_OFFSET, 0x00000138
.equ	DMA_CH4_AL3_TRANS_COUNT_BITS, 0xffffffff
.equ	DMA_CH4_AL3_TRANS_COUNT_MSB, 31
.equ	DMA_CH4_AL3_TRANS_COUNT_LSB, 0
# =============================================================================
# Register    : DMA_CH4_AL3_READ_ADDR_TRIG
# Description : Alias for channel 4 READ_ADDR register
#               This is a trigger register (0xc). Writing a nonzero value will
#               reload the channel counter and start the channel.
.equ	DMA_CH4_AL3_READ_ADDR_TRIG_OFFSET, 0x0000013c
.equ	DMA_CH4_AL3_READ_ADDR_TRIG_BITS, 0xffffffff
.equ	DMA_CH4_AL3_READ_ADDR_TRIG_MSB, 31
.equ	DMA_CH4_AL3_READ_ADDR_TRIG_LSB, 0
# =============================================================================
# Register    : DMA_CH5_READ_ADDR
# Description : DMA Channel 5 Read Address pointer
#               This register updates automatically each time a read completes.
#               The current value is the next address to be read by this
#               channel.
.equ	DMA_CH5_READ_ADDR_OFFSET, 0x00000140
.equ	DMA_CH5_READ_ADDR_BITS, 0xffffffff
.equ	DMA_CH5_READ_ADDR_RESET, 0x00000000
.equ	DMA_CH5_READ_ADDR_MSB, 31
.equ	DMA_CH5_READ_ADDR_LSB, 0
# =============================================================================
# Register    : DMA_CH5_WRITE_ADDR
# Description : DMA Channel 5 Write Address pointer
#               This register updates automatically each time a write
#               completes. The current value is the next address to be written
#               by this channel.
.equ	DMA_CH5_WRITE_ADDR_OFFSET, 0x00000144
.equ	DMA_CH5_WRITE_ADDR_BITS, 0xffffffff
.equ	DMA_CH5_WRITE_ADDR_RESET, 0x00000000
.equ	DMA_CH5_WRITE_ADDR_MSB, 31
.equ	DMA_CH5_WRITE_ADDR_LSB, 0
# =============================================================================
# Register    : DMA_CH5_TRANS_COUNT
# Description : DMA Channel 5 Transfer Count
.equ	DMA_CH5_TRANS_COUNT_OFFSET, 0x00000148
.equ	DMA_CH5_TRANS_COUNT_BITS, 0xffffffff
.equ	DMA_CH5_TRANS_COUNT_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : DMA_CH5_TRANS_COUNT_MODE
# Description : When MODE is 0x0, the transfer count decrements with each
#               transfer until 0, and then the channel triggers the next
#               channel indicated by CTRL_CHAIN_TO.
#
#               When MODE is 0x1, the transfer count decrements with each
#               transfer until 0, and then the channel re-triggers itself, in
#               addition to the trigger indicated by CTRL_CHAIN_TO. This is
#               useful for e.g. an endless ring-buffer DMA with periodic
#               interrupts.
#
#               When MODE is 0xf, the transfer count does not decrement. The
#               DMA channel performs an endless sequence of transfers, never
#               triggering other channels or raising interrupts, until an ABORT
#               is raised.
#
#               All other values are reserved.
#               0x0 -> NORMAL
#               0x1 -> TRIGGER_SELF
#               0xf -> ENDLESS
.equ	DMA_CH5_TRANS_COUNT_MODE_RESET, 0x0
.equ	DMA_CH5_TRANS_COUNT_MODE_BITS, 0xf0000000
.equ	DMA_CH5_TRANS_COUNT_MODE_MSB, 31
.equ	DMA_CH5_TRANS_COUNT_MODE_LSB, 28
.equ	DMA_CH5_TRANS_COUNT_MODE_VALUE_NORMAL, 0x0
.equ	DMA_CH5_TRANS_COUNT_MODE_VALUE_TRIGGER_SELF, 0x1
.equ	DMA_CH5_TRANS_COUNT_MODE_VALUE_ENDLESS, 0xf
# -----------------------------------------------------------------------------
# Field       : DMA_CH5_TRANS_COUNT_COUNT
# Description : 28-bit transfer count (256 million transfers maximum).
#
#               Program the number of bus transfers a channel will perform
#               before halting. Note that, if transfers are larger than one
#               byte in size, this is not equal to the number of bytes
#               transferred (see CTRL_DATA_SIZE).
#
#               When the channel is active, reading this register shows the
#               number of transfers remaining, updating automatically each time
#               a write transfer completes.
#
#               Writing this register sets the RELOAD value for the transfer
#               counter. Each time this channel is triggered, the RELOAD value
#               is copied into the live transfer counter. The channel can be
#               started multiple times, and will perform the same number of
#               transfers each time, as programmed by most recent write.
#
#               The RELOAD value can be observed at CHx_DBG_TCR. If TRANS_COUNT
#               is used as a trigger, the written value is used immediately as
#               the length of the new transfer sequence, as well as being
#               written to RELOAD.
.equ	DMA_CH5_TRANS_COUNT_COUNT_RESET, 0x0000000
.equ	DMA_CH5_TRANS_COUNT_COUNT_BITS, 0x0fffffff
.equ	DMA_CH5_TRANS_COUNT_COUNT_MSB, 27
.equ	DMA_CH5_TRANS_COUNT_COUNT_LSB, 0
# =============================================================================
# Register    : DMA_CH5_CTRL_TRIG
# Description : DMA Channel 5 Control and Status
.equ	DMA_CH5_CTRL_TRIG_OFFSET, 0x0000014c
.equ	DMA_CH5_CTRL_TRIG_BITS, 0xe7ffffff
.equ	DMA_CH5_CTRL_TRIG_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : DMA_CH5_CTRL_TRIG_AHB_ERROR
# Description : Logical OR of the READ_ERROR and WRITE_ERROR flags. The channel
#               halts when it encounters any bus error, and always raises its
#               channel IRQ flag.
.equ	DMA_CH5_CTRL_TRIG_AHB_ERROR_RESET, 0x0
.equ	DMA_CH5_CTRL_TRIG_AHB_ERROR_BITS, 0x80000000
.equ	DMA_CH5_CTRL_TRIG_AHB_ERROR_MSB, 31
.equ	DMA_CH5_CTRL_TRIG_AHB_ERROR_LSB, 31
# -----------------------------------------------------------------------------
# Field       : DMA_CH5_CTRL_TRIG_READ_ERROR
# Description : If 1, the channel received a read bus error. Write one to
#               clear.
#               READ_ADDR shows the approximate address where the bus error was
#               encountered (will not be earlier, or more than 3 transfers
#               later)
.equ	DMA_CH5_CTRL_TRIG_READ_ERROR_RESET, 0x0
.equ	DMA_CH5_CTRL_TRIG_READ_ERROR_BITS, 0x40000000
.equ	DMA_CH5_CTRL_TRIG_READ_ERROR_MSB, 30
.equ	DMA_CH5_CTRL_TRIG_READ_ERROR_LSB, 30
# -----------------------------------------------------------------------------
# Field       : DMA_CH5_CTRL_TRIG_WRITE_ERROR
# Description : If 1, the channel received a write bus error. Write one to
#               clear.
#               WRITE_ADDR shows the approximate address where the bus error
#               was encountered (will not be earlier, or more than 5 transfers
#               later)
.equ	DMA_CH5_CTRL_TRIG_WRITE_ERROR_RESET, 0x0
.equ	DMA_CH5_CTRL_TRIG_WRITE_ERROR_BITS, 0x20000000
.equ	DMA_CH5_CTRL_TRIG_WRITE_ERROR_MSB, 29
.equ	DMA_CH5_CTRL_TRIG_WRITE_ERROR_LSB, 29
# -----------------------------------------------------------------------------
# Field       : DMA_CH5_CTRL_TRIG_BUSY
# Description : This flag goes high when the channel starts a new transfer
#               sequence, and low when the last transfer of that sequence
#               completes. Clearing EN while BUSY is high pauses the channel,
#               and BUSY will stay high while paused.
#
#               To terminate a sequence early (and clear the BUSY flag), see
#               CHAN_ABORT.
.equ	DMA_CH5_CTRL_TRIG_BUSY_RESET, 0x0
.equ	DMA_CH5_CTRL_TRIG_BUSY_BITS, 0x04000000
.equ	DMA_CH5_CTRL_TRIG_BUSY_MSB, 26
.equ	DMA_CH5_CTRL_TRIG_BUSY_LSB, 26
# -----------------------------------------------------------------------------
# Field       : DMA_CH5_CTRL_TRIG_SNIFF_EN
# Description : If 1, this channel's data transfers are visible to the sniff
#               hardware, and each transfer will advance the state of the
#               checksum. This only applies if the sniff hardware is enabled,
#               and has this channel selected.
#
#               This allows checksum to be enabled or disabled on a per-
#               control- block basis.
.equ	DMA_CH5_CTRL_TRIG_SNIFF_EN_RESET, 0x0
.equ	DMA_CH5_CTRL_TRIG_SNIFF_EN_BITS, 0x02000000
.equ	DMA_CH5_CTRL_TRIG_SNIFF_EN_MSB, 25
.equ	DMA_CH5_CTRL_TRIG_SNIFF_EN_LSB, 25
# -----------------------------------------------------------------------------
# Field       : DMA_CH5_CTRL_TRIG_BSWAP
# Description : Apply byte-swap transformation to DMA data.
#               For byte data, this has no effect. For halfword data, the two
#               bytes of each halfword are swapped. For word data, the four
#               bytes of each word are swapped to reverse order.
.equ	DMA_CH5_CTRL_TRIG_BSWAP_RESET, 0x0
.equ	DMA_CH5_CTRL_TRIG_BSWAP_BITS, 0x01000000
.equ	DMA_CH5_CTRL_TRIG_BSWAP_MSB, 24
.equ	DMA_CH5_CTRL_TRIG_BSWAP_LSB, 24
# -----------------------------------------------------------------------------
# Field       : DMA_CH5_CTRL_TRIG_IRQ_QUIET
# Description : In QUIET mode, the channel does not generate IRQs at the end of
#               every transfer block. Instead, an IRQ is raised when NULL is
#               written to a trigger register, indicating the end of a control
#               block chain.
#
#               This reduces the number of interrupts to be serviced by the CPU
#               when transferring a DMA chain of many small control blocks.
.equ	DMA_CH5_CTRL_TRIG_IRQ_QUIET_RESET, 0x0
.equ	DMA_CH5_CTRL_TRIG_IRQ_QUIET_BITS, 0x00800000
.equ	DMA_CH5_CTRL_TRIG_IRQ_QUIET_MSB, 23
.equ	DMA_CH5_CTRL_TRIG_IRQ_QUIET_LSB, 23
# -----------------------------------------------------------------------------
# Field       : DMA_CH5_CTRL_TRIG_TREQ_SEL
# Description : Select a Transfer Request signal.
#               The channel uses the transfer request signal to pace its data
#               transfer rate. Sources for TREQ signals are internal (TIMERS)
#               or external (DREQ, a Data Request from the system).
#               0x0 to 0x3a -> select DREQ n as TREQ
#               0x3b -> Select Timer 0 as TREQ
#               0x3c -> Select Timer 1 as TREQ
#               0x3d -> Select Timer 2 as TREQ (Optional)
#               0x3e -> Select Timer 3 as TREQ (Optional)
#               0x3f -> Permanent request, for unpaced transfers.
.equ	DMA_CH5_CTRL_TRIG_TREQ_SEL_RESET, 0x00
.equ	DMA_CH5_CTRL_TRIG_TREQ_SEL_BITS, 0x007e0000
.equ	DMA_CH5_CTRL_TRIG_TREQ_SEL_MSB, 22
.equ	DMA_CH5_CTRL_TRIG_TREQ_SEL_LSB, 17
.equ	DMA_CH5_CTRL_TRIG_TREQ_SEL_VALUE_TIMER0, 0x3b
.equ	DMA_CH5_CTRL_TRIG_TREQ_SEL_VALUE_TIMER1, 0x3c
.equ	DMA_CH5_CTRL_TRIG_TREQ_SEL_VALUE_TIMER2, 0x3d
.equ	DMA_CH5_CTRL_TRIG_TREQ_SEL_VALUE_TIMER3, 0x3e
.equ	DMA_CH5_CTRL_TRIG_TREQ_SEL_VALUE_PERMANENT, 0x3f
# -----------------------------------------------------------------------------
# Field       : DMA_CH5_CTRL_TRIG_CHAIN_TO
# Description : When this channel completes, it will trigger the channel
#               indicated by CHAIN_TO. Disable by setting CHAIN_TO = _(this
#               channel)_.
#
#               Note this field resets to 0, so channels 1 and above will chain
#               to channel 0 by default. Set this field to avoid this
#               behaviour.
.equ	DMA_CH5_CTRL_TRIG_CHAIN_TO_RESET, 0x0
.equ	DMA_CH5_CTRL_TRIG_CHAIN_TO_BITS, 0x0001e000
.equ	DMA_CH5_CTRL_TRIG_CHAIN_TO_MSB, 16
.equ	DMA_CH5_CTRL_TRIG_CHAIN_TO_LSB, 13
# -----------------------------------------------------------------------------
# Field       : DMA_CH5_CTRL_TRIG_RING_SEL
# Description : Select whether RING_SIZE applies to read or write addresses.
#               If 0, read addresses are wrapped on a (1 << RING_SIZE)
#               boundary. If 1, write addresses are wrapped.
.equ	DMA_CH5_CTRL_TRIG_RING_SEL_RESET, 0x0
.equ	DMA_CH5_CTRL_TRIG_RING_SEL_BITS, 0x00001000
.equ	DMA_CH5_CTRL_TRIG_RING_SEL_MSB, 12
.equ	DMA_CH5_CTRL_TRIG_RING_SEL_LSB, 12
# -----------------------------------------------------------------------------
# Field       : DMA_CH5_CTRL_TRIG_RING_SIZE
# Description : Size of address wrap region. If 0, don't wrap. For values n >
#               0, only the lower n bits of the address will change. This wraps
#               the address on a (1 << n) byte boundary, facilitating access to
#               naturally-aligned ring buffers.
#
#               Ring sizes between 2 and 32768 bytes are possible. This can
#               apply to either read or write addresses, based on value of
#               RING_SEL.
#               0x0 -> RING_NONE
.equ	DMA_CH5_CTRL_TRIG_RING_SIZE_RESET, 0x0
.equ	DMA_CH5_CTRL_TRIG_RING_SIZE_BITS, 0x00000f00
.equ	DMA_CH5_CTRL_TRIG_RING_SIZE_MSB, 11
.equ	DMA_CH5_CTRL_TRIG_RING_SIZE_LSB, 8
.equ	DMA_CH5_CTRL_TRIG_RING_SIZE_VALUE_RING_NONE, 0x0
# -----------------------------------------------------------------------------
# Field       : DMA_CH5_CTRL_TRIG_INCR_WRITE_REV
# Description : If 1, and INCR_WRITE is 1, the write address is decremented
#               rather than incremented with each transfer.
#
#               If 1, and INCR_WRITE is 0, this otherwise-unused combination
#               causes the write address to be incremented by twice the
#               transfer size, i.e. skipping over alternate addresses.
.equ	DMA_CH5_CTRL_TRIG_INCR_WRITE_REV_RESET, 0x0
.equ	DMA_CH5_CTRL_TRIG_INCR_WRITE_REV_BITS, 0x00000080
.equ	DMA_CH5_CTRL_TRIG_INCR_WRITE_REV_MSB, 7
.equ	DMA_CH5_CTRL_TRIG_INCR_WRITE_REV_LSB, 7
# -----------------------------------------------------------------------------
# Field       : DMA_CH5_CTRL_TRIG_INCR_WRITE
# Description : If 1, the write address increments with each transfer. If 0,
#               each write is directed to the same, initial address.
#
#               Generally this should be disabled for memory-to-peripheral
#               transfers.
.equ	DMA_CH5_CTRL_TRIG_INCR_WRITE_RESET, 0x0
.equ	DMA_CH5_CTRL_TRIG_INCR_WRITE_BITS, 0x00000040
.equ	DMA_CH5_CTRL_TRIG_INCR_WRITE_MSB, 6
.equ	DMA_CH5_CTRL_TRIG_INCR_WRITE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : DMA_CH5_CTRL_TRIG_INCR_READ_REV
# Description : If 1, and INCR_READ is 1, the read address is decremented
