konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/dma.inc
#               When 1, the channel will respond to triggering events, which
#               will cause it to become BUSY and start transferring data. When
#               0, the channel will ignore triggers, stop issuing transfers,
#               and pause the current transfer sequence (i.e. BUSY will remain
#               high if already high)
.equ	DMA_CH15_CTRL_TRIG_EN_RESET, 0x0
.equ	DMA_CH15_CTRL_TRIG_EN_BITS, 0x00000001
.equ	DMA_CH15_CTRL_TRIG_EN_MSB, 0
.equ	DMA_CH15_CTRL_TRIG_EN_LSB, 0
# =============================================================================
# Register    : DMA_CH15_AL1_CTRL
# Description : Alias for channel 15 CTRL register
.equ	DMA_CH15_AL1_CTRL_OFFSET, 0x000003d0
.equ	DMA_CH15_AL1_CTRL_BITS, 0xffffffff
.equ	DMA_CH15_AL1_CTRL_MSB, 31
.equ	DMA_CH15_AL1_CTRL_LSB, 0
# =============================================================================
# Register    : DMA_CH15_AL1_READ_ADDR
# Description : Alias for channel 15 READ_ADDR register
.equ	DMA_CH15_AL1_READ_ADDR_OFFSET, 0x000003d4
.equ	DMA_CH15_AL1_READ_ADDR_BITS, 0xffffffff
.equ	DMA_CH15_AL1_READ_ADDR_MSB, 31
.equ	DMA_CH15_AL1_READ_ADDR_LSB, 0
# =============================================================================
# Register    : DMA_CH15_AL1_WRITE_ADDR
# Description : Alias for channel 15 WRITE_ADDR register
.equ	DMA_CH15_AL1_WRITE_ADDR_OFFSET, 0x000003d8
.equ	DMA_CH15_AL1_WRITE_ADDR_BITS, 0xffffffff
.equ	DMA_CH15_AL1_WRITE_ADDR_MSB, 31
.equ	DMA_CH15_AL1_WRITE_ADDR_LSB, 0
# =============================================================================
# Register    : DMA_CH15_AL1_TRANS_COUNT_TRIG
# Description : Alias for channel 15 TRANS_COUNT register
#               This is a trigger register (0xc). Writing a nonzero value will
#               reload the channel counter and start the channel.
.equ	DMA_CH15_AL1_TRANS_COUNT_TRIG_OFFSET, 0x000003dc
.equ	DMA_CH15_AL1_TRANS_COUNT_TRIG_BITS, 0xffffffff
.equ	DMA_CH15_AL1_TRANS_COUNT_TRIG_MSB, 31
.equ	DMA_CH15_AL1_TRANS_COUNT_TRIG_LSB, 0
# =============================================================================
# Register    : DMA_CH15_AL2_CTRL
# Description : Alias for channel 15 CTRL register
.equ	DMA_CH15_AL2_CTRL_OFFSET, 0x000003e0
.equ	DMA_CH15_AL2_CTRL_BITS, 0xffffffff
.equ	DMA_CH15_AL2_CTRL_MSB, 31
.equ	DMA_CH15_AL2_CTRL_LSB, 0
# =============================================================================
# Register    : DMA_CH15_AL2_TRANS_COUNT
# Description : Alias for channel 15 TRANS_COUNT register
.equ	DMA_CH15_AL2_TRANS_COUNT_OFFSET, 0x000003e4
.equ	DMA_CH15_AL2_TRANS_COUNT_BITS, 0xffffffff
.equ	DMA_CH15_AL2_TRANS_COUNT_MSB, 31
.equ	DMA_CH15_AL2_TRANS_COUNT_LSB, 0
# =============================================================================
# Register    : DMA_CH15_AL2_READ_ADDR
# Description : Alias for channel 15 READ_ADDR register
.equ	DMA_CH15_AL2_READ_ADDR_OFFSET, 0x000003e8
.equ	DMA_CH15_AL2_READ_ADDR_BITS, 0xffffffff
.equ	DMA_CH15_AL2_READ_ADDR_MSB, 31
.equ	DMA_CH15_AL2_READ_ADDR_LSB, 0
# =============================================================================
# Register    : DMA_CH15_AL2_WRITE_ADDR_TRIG
# Description : Alias for channel 15 WRITE_ADDR register
#               This is a trigger register (0xc). Writing a nonzero value will
#               reload the channel counter and start the channel.
.equ	DMA_CH15_AL2_WRITE_ADDR_TRIG_OFFSET, 0x000003ec
.equ	DMA_CH15_AL2_WRITE_ADDR_TRIG_BITS, 0xffffffff
.equ	DMA_CH15_AL2_WRITE_ADDR_TRIG_MSB, 31
.equ	DMA_CH15_AL2_WRITE_ADDR_TRIG_LSB, 0
# =============================================================================
# Register    : DMA_CH15_AL3_CTRL
# Description : Alias for channel 15 CTRL register
.equ	DMA_CH15_AL3_CTRL_OFFSET, 0x000003f0
.equ	DMA_CH15_AL3_CTRL_BITS, 0xffffffff
.equ	DMA_CH15_AL3_CTRL_MSB, 31
.equ	DMA_CH15_AL3_CTRL_LSB, 0
# =============================================================================
# Register    : DMA_CH15_AL3_WRITE_ADDR
# Description : Alias for channel 15 WRITE_ADDR register
.equ	DMA_CH15_AL3_WRITE_ADDR_OFFSET, 0x000003f4
.equ	DMA_CH15_AL3_WRITE_ADDR_BITS, 0xffffffff
.equ	DMA_CH15_AL3_WRITE_ADDR_MSB, 31
.equ	DMA_CH15_AL3_WRITE_ADDR_LSB, 0
# =============================================================================
# Register    : DMA_CH15_AL3_TRANS_COUNT
# Description : Alias for channel 15 TRANS_COUNT register
.equ	DMA_CH15_AL3_TRANS_COUNT_OFFSET, 0x000003f8
.equ	DMA_CH15_AL3_TRANS_COUNT_BITS, 0xffffffff
.equ	DMA_CH15_AL3_TRANS_COUNT_MSB, 31
.equ	DMA_CH15_AL3_TRANS_COUNT_LSB, 0
# =============================================================================
# Register    : DMA_CH15_AL3_READ_ADDR_TRIG
# Description : Alias for channel 15 READ_ADDR register
#               This is a trigger register (0xc). Writing a nonzero value will
#               reload the channel counter and start the channel.
.equ	DMA_CH15_AL3_READ_ADDR_TRIG_OFFSET, 0x000003fc
.equ	DMA_CH15_AL3_READ_ADDR_TRIG_BITS, 0xffffffff
.equ	DMA_CH15_AL3_READ_ADDR_TRIG_MSB, 31
.equ	DMA_CH15_AL3_READ_ADDR_TRIG_LSB, 0
# =============================================================================
# Register    : DMA_INTR
# Description : Interrupt Status (raw)
#               Raw interrupt status for DMA Channels 0..15. Bit n corresponds
#               to channel n. Ignores any masking or forcing. Channel
#               interrupts can be cleared by writing a bit mask to INTR or
#               INTS0/1/2/3.
#
#               Channel interrupts can be routed to either of four system-level
#               IRQs based on INTE0, INTE1, INTE2 and INTE3.
#
#               The multiple system-level interrupts might be used to allow
#               NVIC IRQ preemption for more time-critical channels, to spread
#               IRQ load across different cores, or to target IRQs to different
#               security domains.
#
#               It is also valid to ignore the multiple IRQs, and just use
#               INTE0/INTS0/IRQ 0.
#
#               If this register is accessed at a security/privilege level less
#               than that of a given channel (as defined by that channel's
#               SECCFG_CHx register), then that channel's interrupt status will
#               read as 0, ignore writes.
.equ	DMA_INTR_OFFSET, 0x00000400
.equ	DMA_INTR_BITS, 0x0000ffff
.equ	DMA_INTR_RESET, 0x00000000
.equ	DMA_INTR_MSB, 15
.equ	DMA_INTR_LSB, 0
# =============================================================================
# Register    : DMA_INTE0
# Description : Interrupt Enables for IRQ 0
#               Set bit n to pass interrupts from channel n to DMA IRQ 0.
#
#               Note this bit has no effect if the channel security/privilege
#               level, defined by SECCFG_CHx, is greater than the IRQ
#               security/privilege defined by SECCFG_IRQ0.
.equ	DMA_INTE0_OFFSET, 0x00000404
.equ	DMA_INTE0_BITS, 0x0000ffff
.equ	DMA_INTE0_RESET, 0x00000000
.equ	DMA_INTE0_MSB, 15
.equ	DMA_INTE0_LSB, 0
# =============================================================================
# Register    : DMA_INTF0
# Description : Force Interrupts
#               Write 1s to force the corresponding bits in INTS0. The
#               interrupt remains asserted until INTF0 is cleared.
.equ	DMA_INTF0_OFFSET, 0x00000408
.equ	DMA_INTF0_BITS, 0x0000ffff
.equ	DMA_INTF0_RESET, 0x00000000
.equ	DMA_INTF0_MSB, 15
.equ	DMA_INTF0_LSB, 0
# =============================================================================
# Register    : DMA_INTS0
# Description : Interrupt Status for IRQ 0
#               Indicates active channel interrupt requests which are currently
#               causing IRQ 0 to be asserted.
#               Channel interrupts can be cleared by writing a bit mask here.
#
#               Channels with a security/privilege (SECCFG_CHx) greater
#               SECCFG_IRQ0) read as 0 in this register, and ignore writes.
.equ	DMA_INTS0_OFFSET, 0x0000040c
.equ	DMA_INTS0_BITS, 0x0000ffff
.equ	DMA_INTS0_RESET, 0x00000000
.equ	DMA_INTS0_MSB, 15
.equ	DMA_INTS0_LSB, 0
# =============================================================================
# Register    : DMA_INTE1
# Description : Interrupt Enables for IRQ 1
#               Set bit n to pass interrupts from channel n to DMA IRQ 1.
#
#               Note this bit has no effect if the channel security/privilege
#               level, defined by SECCFG_CHx, is greater than the IRQ
#               security/privilege defined by SECCFG_IRQ1.
.equ	DMA_INTE1_OFFSET, 0x00000414
.equ	DMA_INTE1_BITS, 0x0000ffff
.equ	DMA_INTE1_RESET, 0x00000000
.equ	DMA_INTE1_MSB, 15
.equ	DMA_INTE1_LSB, 0
# =============================================================================
# Register    : DMA_INTF1
# Description : Force Interrupts
#               Write 1s to force the corresponding bits in INTS1. The
#               interrupt remains asserted until INTF1 is cleared.
.equ	DMA_INTF1_OFFSET, 0x00000418
.equ	DMA_INTF1_BITS, 0x0000ffff
.equ	DMA_INTF1_RESET, 0x00000000
.equ	DMA_INTF1_MSB, 15
.equ	DMA_INTF1_LSB, 0
# =============================================================================
# Register    : DMA_INTS1
# Description : Interrupt Status for IRQ 1
#               Indicates active channel interrupt requests which are currently
#               causing IRQ 1 to be asserted.
#               Channel interrupts can be cleared by writing a bit mask here.
#
#               Channels with a security/privilege (SECCFG_CHx) greater
#               SECCFG_IRQ1) read as 0 in this register, and ignore writes.
.equ	DMA_INTS1_OFFSET, 0x0000041c
.equ	DMA_INTS1_BITS, 0x0000ffff
.equ	DMA_INTS1_RESET, 0x00000000
.equ	DMA_INTS1_MSB, 15
.equ	DMA_INTS1_LSB, 0
# =============================================================================
# Register    : DMA_INTE2
# Description : Interrupt Enables for IRQ 2
#               Set bit n to pass interrupts from channel n to DMA IRQ 2.
#
#               Note this bit has no effect if the channel security/privilege
#               level, defined by SECCFG_CHx, is greater than the IRQ
#               security/privilege defined by SECCFG_IRQ2.
.equ	DMA_INTE2_OFFSET, 0x00000424
.equ	DMA_INTE2_BITS, 0x0000ffff
.equ	DMA_INTE2_RESET, 0x00000000
.equ	DMA_INTE2_MSB, 15
.equ	DMA_INTE2_LSB, 0
# =============================================================================
# Register    : DMA_INTF2
# Description : Force Interrupts
#               Write 1s to force the corresponding bits in INTS2. The
#               interrupt remains asserted until INTF2 is cleared.
.equ	DMA_INTF2_OFFSET, 0x00000428
.equ	DMA_INTF2_BITS, 0x0000ffff
.equ	DMA_INTF2_RESET, 0x00000000
.equ	DMA_INTF2_MSB, 15
.equ	DMA_INTF2_LSB, 0
# =============================================================================
# Register    : DMA_INTS2
# Description : Interrupt Status for IRQ 2
#               Indicates active channel interrupt requests which are currently
#               causing IRQ 2 to be asserted.
#               Channel interrupts can be cleared by writing a bit mask here.
#
#               Channels with a security/privilege (SECCFG_CHx) greater
#               SECCFG_IRQ2) read as 0 in this register, and ignore writes.
.equ	DMA_INTS2_OFFSET, 0x0000042c
.equ	DMA_INTS2_BITS, 0x0000ffff
.equ	DMA_INTS2_RESET, 0x00000000
.equ	DMA_INTS2_MSB, 15
.equ	DMA_INTS2_LSB, 0
# =============================================================================
# Register    : DMA_INTE3
# Description : Interrupt Enables for IRQ 3
#               Set bit n to pass interrupts from channel n to DMA IRQ 3.
#
#               Note this bit has no effect if the channel security/privilege
#               level, defined by SECCFG_CHx, is greater than the IRQ
#               security/privilege defined by SECCFG_IRQ3.
.equ	DMA_INTE3_OFFSET, 0x00000434
.equ	DMA_INTE3_BITS, 0x0000ffff
.equ	DMA_INTE3_RESET, 0x00000000
.equ	DMA_INTE3_MSB, 15
.equ	DMA_INTE3_LSB, 0
# =============================================================================
# Register    : DMA_INTF3
# Description : Force Interrupts
#               Write 1s to force the corresponding bits in INTS3. The
#               interrupt remains asserted until INTF3 is cleared.
.equ	DMA_INTF3_OFFSET, 0x00000438
.equ	DMA_INTF3_BITS, 0x0000ffff
.equ	DMA_INTF3_RESET, 0x00000000
.equ	DMA_INTF3_MSB, 15
.equ	DMA_INTF3_LSB, 0
# =============================================================================
# Register    : DMA_INTS3
# Description : Interrupt Status for IRQ 3
#               Indicates active channel interrupt requests which are currently
#               causing IRQ 3 to be asserted.
#               Channel interrupts can be cleared by writing a bit mask here.
#
#               Channels with a security/privilege (SECCFG_CHx) greater
#               SECCFG_IRQ3) read as 0 in this register, and ignore writes.
.equ	DMA_INTS3_OFFSET, 0x0000043c
.equ	DMA_INTS3_BITS, 0x0000ffff
.equ	DMA_INTS3_RESET, 0x00000000
.equ	DMA_INTS3_MSB, 15
.equ	DMA_INTS3_LSB, 0
# =============================================================================
# Register    : DMA_TIMER0
# Description : Pacing (X/Y) fractional timer
#               The pacing timer produces TREQ assertions at a rate set by
#               ((X/Y) * sys_clk). This equation is evaluated every sys_clk
#               cycles and therefore can only generate TREQs at a rate of 1 per
#               sys_clk (i.e. permanent TREQ) or less.
.equ	DMA_TIMER0_OFFSET, 0x00000440
.equ	DMA_TIMER0_BITS, 0xffffffff
.equ	DMA_TIMER0_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : DMA_TIMER0_X
# Description : Pacing Timer Dividend. Specifies the X value for the (X/Y)
#               fractional timer.
.equ	DMA_TIMER0_X_RESET, 0x0000
.equ	DMA_TIMER0_X_BITS, 0xffff0000
.equ	DMA_TIMER0_X_MSB, 31
.equ	DMA_TIMER0_X_LSB, 16
# -----------------------------------------------------------------------------
# Field       : DMA_TIMER0_Y
# Description : Pacing Timer Divisor. Specifies the Y value for the (X/Y)
#               fractional timer.
.equ	DMA_TIMER0_Y_RESET, 0x0000
.equ	DMA_TIMER0_Y_BITS, 0x0000ffff
.equ	DMA_TIMER0_Y_MSB, 15
.equ	DMA_TIMER0_Y_LSB, 0
# =============================================================================
# Register    : DMA_TIMER1
# Description : Pacing (X/Y) fractional timer
#               The pacing timer produces TREQ assertions at a rate set by
#               ((X/Y) * sys_clk). This equation is evaluated every sys_clk
#               cycles and therefore can only generate TREQs at a rate of 1 per
#               sys_clk (i.e. permanent TREQ) or less.
.equ	DMA_TIMER1_OFFSET, 0x00000444
.equ	DMA_TIMER1_BITS, 0xffffffff
.equ	DMA_TIMER1_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : DMA_TIMER1_X
# Description : Pacing Timer Dividend. Specifies the X value for the (X/Y)
#               fractional timer.
.equ	DMA_TIMER1_X_RESET, 0x0000
.equ	DMA_TIMER1_X_BITS, 0xffff0000
.equ	DMA_TIMER1_X_MSB, 31
.equ	DMA_TIMER1_X_LSB, 16
# -----------------------------------------------------------------------------
# Field       : DMA_TIMER1_Y
# Description : Pacing Timer Divisor. Specifies the Y value for the (X/Y)
#               fractional timer.
.equ	DMA_TIMER1_Y_RESET, 0x0000
.equ	DMA_TIMER1_Y_BITS, 0x0000ffff
.equ	DMA_TIMER1_Y_MSB, 15
.equ	DMA_TIMER1_Y_LSB, 0
# =============================================================================
# Register    : DMA_TIMER2
# Description : Pacing (X/Y) fractional timer
#               The pacing timer produces TREQ assertions at a rate set by
#               ((X/Y) * sys_clk). This equation is evaluated every sys_clk
#               cycles and therefore can only generate TREQs at a rate of 1 per
#               sys_clk (i.e. permanent TREQ) or less.
.equ	DMA_TIMER2_OFFSET, 0x00000448
.equ	DMA_TIMER2_BITS, 0xffffffff
.equ	DMA_TIMER2_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : DMA_TIMER2_X
# Description : Pacing Timer Dividend. Specifies the X value for the (X/Y)
#               fractional timer.
.equ	DMA_TIMER2_X_RESET, 0x0000
.equ	DMA_TIMER2_X_BITS, 0xffff0000
.equ	DMA_TIMER2_X_MSB, 31
.equ	DMA_TIMER2_X_LSB, 16
# -----------------------------------------------------------------------------
# Field       : DMA_TIMER2_Y
# Description : Pacing Timer Divisor. Specifies the Y value for the (X/Y)
#               fractional timer.
.equ	DMA_TIMER2_Y_RESET, 0x0000
.equ	DMA_TIMER2_Y_BITS, 0x0000ffff
.equ	DMA_TIMER2_Y_MSB, 15
.equ	DMA_TIMER2_Y_LSB, 0
# =============================================================================
# Register    : DMA_TIMER3
# Description : Pacing (X/Y) fractional timer
#               The pacing timer produces TREQ assertions at a rate set by
#               ((X/Y) * sys_clk). This equation is evaluated every sys_clk
#               cycles and therefore can only generate TREQs at a rate of 1 per
#               sys_clk (i.e. permanent TREQ) or less.
.equ	DMA_TIMER3_OFFSET, 0x0000044c
.equ	DMA_TIMER3_BITS, 0xffffffff
.equ	DMA_TIMER3_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : DMA_TIMER3_X
# Description : Pacing Timer Dividend. Specifies the X value for the (X/Y)
#               fractional timer.
.equ	DMA_TIMER3_X_RESET, 0x0000
.equ	DMA_TIMER3_X_BITS, 0xffff0000
.equ	DMA_TIMER3_X_MSB, 31
.equ	DMA_TIMER3_X_LSB, 16
# -----------------------------------------------------------------------------
# Field       : DMA_TIMER3_Y
# Description : Pacing Timer Divisor. Specifies the Y value for the (X/Y)
#               fractional timer.
.equ	DMA_TIMER3_Y_RESET, 0x0000
.equ	DMA_TIMER3_Y_BITS, 0x0000ffff
.equ	DMA_TIMER3_Y_MSB, 15
.equ	DMA_TIMER3_Y_LSB, 0
# =============================================================================
# Register    : DMA_MULTI_CHAN_TRIGGER
# Description : Trigger one or more channels simultaneously
#               Each bit in this register corresponds to a DMA channel. Writing
#               a 1 to the relevant bit is the same as writing to that
#               channel's trigger register; the channel will start if it is
#               currently enabled and not already busy.
.equ	DMA_MULTI_CHAN_TRIGGER_OFFSET, 0x00000450
.equ	DMA_MULTI_CHAN_TRIGGER_BITS, 0x0000ffff
.equ	DMA_MULTI_CHAN_TRIGGER_RESET, 0x00000000
.equ	DMA_MULTI_CHAN_TRIGGER_MSB, 15
.equ	DMA_MULTI_CHAN_TRIGGER_LSB, 0
# =============================================================================
# Register    : DMA_SNIFF_CTRL
# Description : Sniffer Control
.equ	DMA_SNIFF_CTRL_OFFSET, 0x00000454
.equ	DMA_SNIFF_CTRL_BITS, 0x00000fff
.equ	DMA_SNIFF_CTRL_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : DMA_SNIFF_CTRL_OUT_INV
# Description : If set, the result appears inverted (bitwise complement) when
#               read. This does not affect the way the checksum is calculated;
#               the result is transformed on-the-fly between the result
#               register and the bus.
.equ	DMA_SNIFF_CTRL_OUT_INV_RESET, 0x0
.equ	DMA_SNIFF_CTRL_OUT_INV_BITS, 0x00000800
.equ	DMA_SNIFF_CTRL_OUT_INV_MSB, 11
.equ	DMA_SNIFF_CTRL_OUT_INV_LSB, 11
# -----------------------------------------------------------------------------
# Field       : DMA_SNIFF_CTRL_OUT_REV
# Description : If set, the result appears bit-reversed when read. This does
#               not affect the way the checksum is calculated; the result is
#               transformed on-the-fly between the result register and the bus.
.equ	DMA_SNIFF_CTRL_OUT_REV_RESET, 0x0
.equ	DMA_SNIFF_CTRL_OUT_REV_BITS, 0x00000400
.equ	DMA_SNIFF_CTRL_OUT_REV_MSB, 10
.equ	DMA_SNIFF_CTRL_OUT_REV_LSB, 10
# -----------------------------------------------------------------------------
# Field       : DMA_SNIFF_CTRL_BSWAP
# Description : Locally perform a byte reverse on the sniffed data, before
#               feeding into checksum.
#
#               Note that the sniff hardware is downstream of the DMA channel
#               byteswap performed in the read master: if channel CTRL_BSWAP
#               and SNIFF_CTRL_BSWAP are both enabled, their effects cancel
#               from the sniffer's point of view.
.equ	DMA_SNIFF_CTRL_BSWAP_RESET, 0x0
.equ	DMA_SNIFF_CTRL_BSWAP_BITS, 0x00000200
.equ	DMA_SNIFF_CTRL_BSWAP_MSB, 9
.equ	DMA_SNIFF_CTRL_BSWAP_LSB, 9
# -----------------------------------------------------------------------------
# Field       : DMA_SNIFF_CTRL_CALC
#               0x0 -> Calculate a CRC-32 (IEEE802.3 polynomial)
#               0x1 -> Calculate a CRC-32 (IEEE802.3 polynomial) with bit reversed data
#               0x2 -> Calculate a CRC-16-CCITT
#               0x3 -> Calculate a CRC-16-CCITT with bit reversed data
#               0xe -> XOR reduction over all data. == 1 if the total 1 population count is odd.
#               0xf -> Calculate a simple 32-bit checksum (addition with a 32 bit accumulator)
.equ	DMA_SNIFF_CTRL_CALC_RESET, 0x0
.equ	DMA_SNIFF_CTRL_CALC_BITS, 0x000001e0
.equ	DMA_SNIFF_CTRL_CALC_MSB, 8
.equ	DMA_SNIFF_CTRL_CALC_LSB, 5
.equ	DMA_SNIFF_CTRL_CALC_VALUE_CRC32, 0x0
.equ	DMA_SNIFF_CTRL_CALC_VALUE_CRC32R, 0x1
.equ	DMA_SNIFF_CTRL_CALC_VALUE_CRC16, 0x2
.equ	DMA_SNIFF_CTRL_CALC_VALUE_CRC16R, 0x3
.equ	DMA_SNIFF_CTRL_CALC_VALUE_EVEN, 0xe
.equ	DMA_SNIFF_CTRL_CALC_VALUE_SUM, 0xf
# -----------------------------------------------------------------------------
# Field       : DMA_SNIFF_CTRL_DMACH
# Description : DMA channel for Sniffer to observe
.equ	DMA_SNIFF_CTRL_DMACH_RESET, 0x0
.equ	DMA_SNIFF_CTRL_DMACH_BITS, 0x0000001e
.equ	DMA_SNIFF_CTRL_DMACH_MSB, 4
.equ	DMA_SNIFF_CTRL_DMACH_LSB, 1
# -----------------------------------------------------------------------------
# Field       : DMA_SNIFF_CTRL_EN
# Description : Enable sniffer
.equ	DMA_SNIFF_CTRL_EN_RESET, 0x0
.equ	DMA_SNIFF_CTRL_EN_BITS, 0x00000001
.equ	DMA_SNIFF_CTRL_EN_MSB, 0
.equ	DMA_SNIFF_CTRL_EN_LSB, 0
# =============================================================================
# Register    : DMA_SNIFF_DATA
# Description : Data accumulator for sniff hardware
#               Write an initial seed value here before starting a DMA transfer
#               on the channel indicated by SNIFF_CTRL_DMACH. The hardware will
#               update this register each time it observes a read from the
#               indicated channel. Once the channel completes, the final result
#               can be read from this register.
.equ	DMA_SNIFF_DATA_OFFSET, 0x00000458
.equ	DMA_SNIFF_DATA_BITS, 0xffffffff
.equ	DMA_SNIFF_DATA_RESET, 0x00000000
.equ	DMA_SNIFF_DATA_MSB, 31
.equ	DMA_SNIFF_DATA_LSB, 0
# =============================================================================
# Register    : DMA_FIFO_LEVELS
# Description : Debug RAF, WAF, TDF levels
.equ	DMA_FIFO_LEVELS_OFFSET, 0x00000460
.equ	DMA_FIFO_LEVELS_BITS, 0x00ffffff
.equ	DMA_FIFO_LEVELS_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : DMA_FIFO_LEVELS_RAF_LVL
# Description : Current Read-Address-FIFO fill level
.equ	DMA_FIFO_LEVELS_RAF_LVL_RESET, 0x00
.equ	DMA_FIFO_LEVELS_RAF_LVL_BITS, 0x00ff0000
.equ	DMA_FIFO_LEVELS_RAF_LVL_MSB, 23
.equ	DMA_FIFO_LEVELS_RAF_LVL_LSB, 16
# -----------------------------------------------------------------------------
# Field       : DMA_FIFO_LEVELS_WAF_LVL
# Description : Current Write-Address-FIFO fill level
.equ	DMA_FIFO_LEVELS_WAF_LVL_RESET, 0x00
.equ	DMA_FIFO_LEVELS_WAF_LVL_BITS, 0x0000ff00
.equ	DMA_FIFO_LEVELS_WAF_LVL_MSB, 15
.equ	DMA_FIFO_LEVELS_WAF_LVL_LSB, 8
# -----------------------------------------------------------------------------
# Field       : DMA_FIFO_LEVELS_TDF_LVL
# Description : Current Transfer-Data-FIFO fill level
.equ	DMA_FIFO_LEVELS_TDF_LVL_RESET, 0x00
.equ	DMA_FIFO_LEVELS_TDF_LVL_BITS, 0x000000ff
.equ	DMA_FIFO_LEVELS_TDF_LVL_MSB, 7
.equ	DMA_FIFO_LEVELS_TDF_LVL_LSB, 0
