konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/dma.inc
# =============================================================================
# Register    : DMA_CHAN_ABORT
# Description : Abort an in-progress transfer sequence on one or more channels
#               Each bit corresponds to a channel. Writing a 1 aborts whatever
#               transfer sequence is in progress on that channel. The bit will
#               remain high until any in-flight transfers have been flushed
#               through the address and data FIFOs.
#
#               After writing, this register must be polled until it returns
#               all-zero. Until this point, it is unsafe to restart the
#               channel.
.equ	DMA_CHAN_ABORT_OFFSET, 0x00000464
.equ	DMA_CHAN_ABORT_BITS, 0x0000ffff
.equ	DMA_CHAN_ABORT_RESET, 0x00000000
.equ	DMA_CHAN_ABORT_MSB, 15
.equ	DMA_CHAN_ABORT_LSB, 0
# =============================================================================
# Register    : DMA_N_CHANNELS
# Description : The number of channels this DMA instance is equipped with. This
#               DMA supports up to 16 hardware channels, but can be configured
#               with as few as one, to minimise silicon area.
.equ	DMA_N_CHANNELS_OFFSET, 0x00000468
.equ	DMA_N_CHANNELS_BITS, 0x0000001f
.equ	DMA_N_CHANNELS_MSB, 4
.equ	DMA_N_CHANNELS_LSB, 0
# =============================================================================
# Register    : DMA_SECCFG_CH0
# Description : Security configuration for channel 0. Control whether this
#               channel performs Secure/Non-secure and Privileged/Unprivileged
#               bus accesses.
#
#               If this channel generates bus accesses of some security level,
#               an access of at least that level (in the order S+P > S+U > NS+P
#               > NS+U) is required to program, trigger, abort, check the
#               status of, interrupt on or acknowledge the interrupt of this
#               channel.
#
#               This register automatically locks down (becomes read-only) once
#               software starts to configure the channel.
#
#               This register is world-readable, but is writable only from a
#               Secure, Privileged context.
.equ	DMA_SECCFG_CH0_OFFSET, 0x00000480
.equ	DMA_SECCFG_CH0_BITS, 0x00000007
.equ	DMA_SECCFG_CH0_RESET, 0x00000003
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_CH0_LOCK
# Description : LOCK is 0 at reset, and is set to 1 automatically upon a
#               successful write to this channel's control registers. That is,
#               a write to CTRL, READ_ADDR, WRITE_ADDR, TRANS_COUNT and their
#               aliases.
#
#               Once its LOCK bit is set, this register becomes read-only.
#
#               A failed write, for example due to the write's privilege being
#               lower than that specified in the channel's SECCFG register,
#               will not set the LOCK bit.
.equ	DMA_SECCFG_CH0_LOCK_RESET, 0x0
.equ	DMA_SECCFG_CH0_LOCK_BITS, 0x00000004
.equ	DMA_SECCFG_CH0_LOCK_MSB, 2
.equ	DMA_SECCFG_CH0_LOCK_LSB, 2
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_CH0_S
# Description : Secure channel. If 1, this channel performs Secure bus
#               accesses. If 0, it performs Non-secure bus accesses.
#
#               If 1, this channel is controllable only from a Secure context.
.equ	DMA_SECCFG_CH0_S_RESET, 0x1
.equ	DMA_SECCFG_CH0_S_BITS, 0x00000002
.equ	DMA_SECCFG_CH0_S_MSB, 1
.equ	DMA_SECCFG_CH0_S_LSB, 1
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_CH0_P
# Description : Privileged channel. If 1, this channel performs Privileged bus
#               accesses. If 0, it performs Unprivileged bus accesses.
#
#               If 1, this channel is controllable only from a Privileged
#               context of the same Secure/Non-secure level, or any context of
#               a higher Secure/Non-secure level.
.equ	DMA_SECCFG_CH0_P_RESET, 0x1
.equ	DMA_SECCFG_CH0_P_BITS, 0x00000001
.equ	DMA_SECCFG_CH0_P_MSB, 0
.equ	DMA_SECCFG_CH0_P_LSB, 0
# =============================================================================
# Register    : DMA_SECCFG_CH1
# Description : Security configuration for channel 1. Control whether this
#               channel performs Secure/Non-secure and Privileged/Unprivileged
#               bus accesses.
#
#               If this channel generates bus accesses of some security level,
#               an access of at least that level (in the order S+P > S+U > NS+P
#               > NS+U) is required to program, trigger, abort, check the
#               status of, interrupt on or acknowledge the interrupt of this
#               channel.
#
#               This register automatically locks down (becomes read-only) once
#               software starts to configure the channel.
#
#               This register is world-readable, but is writable only from a
#               Secure, Privileged context.
.equ	DMA_SECCFG_CH1_OFFSET, 0x00000484
.equ	DMA_SECCFG_CH1_BITS, 0x00000007
.equ	DMA_SECCFG_CH1_RESET, 0x00000003
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_CH1_LOCK
# Description : LOCK is 0 at reset, and is set to 1 automatically upon a
#               successful write to this channel's control registers. That is,
#               a write to CTRL, READ_ADDR, WRITE_ADDR, TRANS_COUNT and their
#               aliases.
#
#               Once its LOCK bit is set, this register becomes read-only.
#
#               A failed write, for example due to the write's privilege being
#               lower than that specified in the channel's SECCFG register,
#               will not set the LOCK bit.
.equ	DMA_SECCFG_CH1_LOCK_RESET, 0x0
.equ	DMA_SECCFG_CH1_LOCK_BITS, 0x00000004
.equ	DMA_SECCFG_CH1_LOCK_MSB, 2
.equ	DMA_SECCFG_CH1_LOCK_LSB, 2
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_CH1_S
# Description : Secure channel. If 1, this channel performs Secure bus
#               accesses. If 0, it performs Non-secure bus accesses.
#
#               If 1, this channel is controllable only from a Secure context.
.equ	DMA_SECCFG_CH1_S_RESET, 0x1
.equ	DMA_SECCFG_CH1_S_BITS, 0x00000002
.equ	DMA_SECCFG_CH1_S_MSB, 1
.equ	DMA_SECCFG_CH1_S_LSB, 1
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_CH1_P
# Description : Privileged channel. If 1, this channel performs Privileged bus
#               accesses. If 0, it performs Unprivileged bus accesses.
#
#               If 1, this channel is controllable only from a Privileged
#               context of the same Secure/Non-secure level, or any context of
#               a higher Secure/Non-secure level.
.equ	DMA_SECCFG_CH1_P_RESET, 0x1
.equ	DMA_SECCFG_CH1_P_BITS, 0x00000001
.equ	DMA_SECCFG_CH1_P_MSB, 0
.equ	DMA_SECCFG_CH1_P_LSB, 0
# =============================================================================
# Register    : DMA_SECCFG_CH2
# Description : Security configuration for channel 2. Control whether this
#               channel performs Secure/Non-secure and Privileged/Unprivileged
#               bus accesses.
#
#               If this channel generates bus accesses of some security level,
#               an access of at least that level (in the order S+P > S+U > NS+P
#               > NS+U) is required to program, trigger, abort, check the
#               status of, interrupt on or acknowledge the interrupt of this
#               channel.
#
#               This register automatically locks down (becomes read-only) once
#               software starts to configure the channel.
#
#               This register is world-readable, but is writable only from a
#               Secure, Privileged context.
.equ	DMA_SECCFG_CH2_OFFSET, 0x00000488
.equ	DMA_SECCFG_CH2_BITS, 0x00000007
.equ	DMA_SECCFG_CH2_RESET, 0x00000003
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_CH2_LOCK
# Description : LOCK is 0 at reset, and is set to 1 automatically upon a
#               successful write to this channel's control registers. That is,
#               a write to CTRL, READ_ADDR, WRITE_ADDR, TRANS_COUNT and their
#               aliases.
#
#               Once its LOCK bit is set, this register becomes read-only.
#
#               A failed write, for example due to the write's privilege being
#               lower than that specified in the channel's SECCFG register,
#               will not set the LOCK bit.
.equ	DMA_SECCFG_CH2_LOCK_RESET, 0x0
.equ	DMA_SECCFG_CH2_LOCK_BITS, 0x00000004
.equ	DMA_SECCFG_CH2_LOCK_MSB, 2
.equ	DMA_SECCFG_CH2_LOCK_LSB, 2
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_CH2_S
# Description : Secure channel. If 1, this channel performs Secure bus
#               accesses. If 0, it performs Non-secure bus accesses.
#
#               If 1, this channel is controllable only from a Secure context.
.equ	DMA_SECCFG_CH2_S_RESET, 0x1
.equ	DMA_SECCFG_CH2_S_BITS, 0x00000002
.equ	DMA_SECCFG_CH2_S_MSB, 1
.equ	DMA_SECCFG_CH2_S_LSB, 1
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_CH2_P
# Description : Privileged channel. If 1, this channel performs Privileged bus
#               accesses. If 0, it performs Unprivileged bus accesses.
#
#               If 1, this channel is controllable only from a Privileged
#               context of the same Secure/Non-secure level, or any context of
#               a higher Secure/Non-secure level.
.equ	DMA_SECCFG_CH2_P_RESET, 0x1
.equ	DMA_SECCFG_CH2_P_BITS, 0x00000001
.equ	DMA_SECCFG_CH2_P_MSB, 0
.equ	DMA_SECCFG_CH2_P_LSB, 0
# =============================================================================
# Register    : DMA_SECCFG_CH3
# Description : Security configuration for channel 3. Control whether this
#               channel performs Secure/Non-secure and Privileged/Unprivileged
#               bus accesses.
#
#               If this channel generates bus accesses of some security level,
#               an access of at least that level (in the order S+P > S+U > NS+P
#               > NS+U) is required to program, trigger, abort, check the
#               status of, interrupt on or acknowledge the interrupt of this
#               channel.
#
#               This register automatically locks down (becomes read-only) once
#               software starts to configure the channel.
#
#               This register is world-readable, but is writable only from a
#               Secure, Privileged context.
.equ	DMA_SECCFG_CH3_OFFSET, 0x0000048c
.equ	DMA_SECCFG_CH3_BITS, 0x00000007
.equ	DMA_SECCFG_CH3_RESET, 0x00000003
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_CH3_LOCK
# Description : LOCK is 0 at reset, and is set to 1 automatically upon a
#               successful write to this channel's control registers. That is,
#               a write to CTRL, READ_ADDR, WRITE_ADDR, TRANS_COUNT and their
#               aliases.
#
#               Once its LOCK bit is set, this register becomes read-only.
#
#               A failed write, for example due to the write's privilege being
#               lower than that specified in the channel's SECCFG register,
#               will not set the LOCK bit.
.equ	DMA_SECCFG_CH3_LOCK_RESET, 0x0
.equ	DMA_SECCFG_CH3_LOCK_BITS, 0x00000004
.equ	DMA_SECCFG_CH3_LOCK_MSB, 2
.equ	DMA_SECCFG_CH3_LOCK_LSB, 2
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_CH3_S
# Description : Secure channel. If 1, this channel performs Secure bus
#               accesses. If 0, it performs Non-secure bus accesses.
#
#               If 1, this channel is controllable only from a Secure context.
.equ	DMA_SECCFG_CH3_S_RESET, 0x1
.equ	DMA_SECCFG_CH3_S_BITS, 0x00000002
.equ	DMA_SECCFG_CH3_S_MSB, 1
.equ	DMA_SECCFG_CH3_S_LSB, 1
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_CH3_P
# Description : Privileged channel. If 1, this channel performs Privileged bus
#               accesses. If 0, it performs Unprivileged bus accesses.
#
#               If 1, this channel is controllable only from a Privileged
#               context of the same Secure/Non-secure level, or any context of
#               a higher Secure/Non-secure level.
.equ	DMA_SECCFG_CH3_P_RESET, 0x1
.equ	DMA_SECCFG_CH3_P_BITS, 0x00000001
.equ	DMA_SECCFG_CH3_P_MSB, 0
.equ	DMA_SECCFG_CH3_P_LSB, 0
# =============================================================================
# Register    : DMA_SECCFG_CH4
# Description : Security configuration for channel 4. Control whether this
#               channel performs Secure/Non-secure and Privileged/Unprivileged
#               bus accesses.
#
#               If this channel generates bus accesses of some security level,
#               an access of at least that level (in the order S+P > S+U > NS+P
#               > NS+U) is required to program, trigger, abort, check the
#               status of, interrupt on or acknowledge the interrupt of this
#               channel.
#
#               This register automatically locks down (becomes read-only) once
#               software starts to configure the channel.
#
#               This register is world-readable, but is writable only from a
#               Secure, Privileged context.
.equ	DMA_SECCFG_CH4_OFFSET, 0x00000490
.equ	DMA_SECCFG_CH4_BITS, 0x00000007
.equ	DMA_SECCFG_CH4_RESET, 0x00000003
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_CH4_LOCK
# Description : LOCK is 0 at reset, and is set to 1 automatically upon a
#               successful write to this channel's control registers. That is,
#               a write to CTRL, READ_ADDR, WRITE_ADDR, TRANS_COUNT and their
#               aliases.
#
#               Once its LOCK bit is set, this register becomes read-only.
#
#               A failed write, for example due to the write's privilege being
#               lower than that specified in the channel's SECCFG register,
#               will not set the LOCK bit.
.equ	DMA_SECCFG_CH4_LOCK_RESET, 0x0
.equ	DMA_SECCFG_CH4_LOCK_BITS, 0x00000004
.equ	DMA_SECCFG_CH4_LOCK_MSB, 2
.equ	DMA_SECCFG_CH4_LOCK_LSB, 2
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_CH4_S
# Description : Secure channel. If 1, this channel performs Secure bus
#               accesses. If 0, it performs Non-secure bus accesses.
#
#               If 1, this channel is controllable only from a Secure context.
.equ	DMA_SECCFG_CH4_S_RESET, 0x1
.equ	DMA_SECCFG_CH4_S_BITS, 0x00000002
.equ	DMA_SECCFG_CH4_S_MSB, 1
.equ	DMA_SECCFG_CH4_S_LSB, 1
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_CH4_P
# Description : Privileged channel. If 1, this channel performs Privileged bus
#               accesses. If 0, it performs Unprivileged bus accesses.
#
#               If 1, this channel is controllable only from a Privileged
#               context of the same Secure/Non-secure level, or any context of
#               a higher Secure/Non-secure level.
.equ	DMA_SECCFG_CH4_P_RESET, 0x1
.equ	DMA_SECCFG_CH4_P_BITS, 0x00000001
.equ	DMA_SECCFG_CH4_P_MSB, 0
.equ	DMA_SECCFG_CH4_P_LSB, 0
# =============================================================================
# Register    : DMA_SECCFG_CH5
# Description : Security configuration for channel 5. Control whether this
#               channel performs Secure/Non-secure and Privileged/Unprivileged
#               bus accesses.
#
#               If this channel generates bus accesses of some security level,
#               an access of at least that level (in the order S+P > S+U > NS+P
#               > NS+U) is required to program, trigger, abort, check the
#               status of, interrupt on or acknowledge the interrupt of this
#               channel.
#
#               This register automatically locks down (becomes read-only) once
#               software starts to configure the channel.
#
#               This register is world-readable, but is writable only from a
#               Secure, Privileged context.
.equ	DMA_SECCFG_CH5_OFFSET, 0x00000494
.equ	DMA_SECCFG_CH5_BITS, 0x00000007
.equ	DMA_SECCFG_CH5_RESET, 0x00000003
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_CH5_LOCK
# Description : LOCK is 0 at reset, and is set to 1 automatically upon a
#               successful write to this channel's control registers. That is,
#               a write to CTRL, READ_ADDR, WRITE_ADDR, TRANS_COUNT and their
#               aliases.
#
#               Once its LOCK bit is set, this register becomes read-only.
#
#               A failed write, for example due to the write's privilege being
#               lower than that specified in the channel's SECCFG register,
#               will not set the LOCK bit.
.equ	DMA_SECCFG_CH5_LOCK_RESET, 0x0
.equ	DMA_SECCFG_CH5_LOCK_BITS, 0x00000004
.equ	DMA_SECCFG_CH5_LOCK_MSB, 2
.equ	DMA_SECCFG_CH5_LOCK_LSB, 2
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_CH5_S
# Description : Secure channel. If 1, this channel performs Secure bus
#               accesses. If 0, it performs Non-secure bus accesses.
#
#               If 1, this channel is controllable only from a Secure context.
.equ	DMA_SECCFG_CH5_S_RESET, 0x1
.equ	DMA_SECCFG_CH5_S_BITS, 0x00000002
.equ	DMA_SECCFG_CH5_S_MSB, 1
.equ	DMA_SECCFG_CH5_S_LSB, 1
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_CH5_P
# Description : Privileged channel. If 1, this channel performs Privileged bus
#               accesses. If 0, it performs Unprivileged bus accesses.
#
#               If 1, this channel is controllable only from a Privileged
#               context of the same Secure/Non-secure level, or any context of
#               a higher Secure/Non-secure level.
.equ	DMA_SECCFG_CH5_P_RESET, 0x1
.equ	DMA_SECCFG_CH5_P_BITS, 0x00000001
.equ	DMA_SECCFG_CH5_P_MSB, 0
.equ	DMA_SECCFG_CH5_P_LSB, 0
# =============================================================================
# Register    : DMA_SECCFG_CH6
# Description : Security configuration for channel 6. Control whether this
#               channel performs Secure/Non-secure and Privileged/Unprivileged
#               bus accesses.
#
#               If this channel generates bus accesses of some security level,
#               an access of at least that level (in the order S+P > S+U > NS+P
#               > NS+U) is required to program, trigger, abort, check the
#               status of, interrupt on or acknowledge the interrupt of this
#               channel.
#
#               This register automatically locks down (becomes read-only) once
#               software starts to configure the channel.
#
#               This register is world-readable, but is writable only from a
#               Secure, Privileged context.
.equ	DMA_SECCFG_CH6_OFFSET, 0x00000498
.equ	DMA_SECCFG_CH6_BITS, 0x00000007
.equ	DMA_SECCFG_CH6_RESET, 0x00000003
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_CH6_LOCK
# Description : LOCK is 0 at reset, and is set to 1 automatically upon a
#               successful write to this channel's control registers. That is,
#               a write to CTRL, READ_ADDR, WRITE_ADDR, TRANS_COUNT and their
#               aliases.
#
#               Once its LOCK bit is set, this register becomes read-only.
#
#               A failed write, for example due to the write's privilege being
#               lower than that specified in the channel's SECCFG register,
#               will not set the LOCK bit.
.equ	DMA_SECCFG_CH6_LOCK_RESET, 0x0
.equ	DMA_SECCFG_CH6_LOCK_BITS, 0x00000004
.equ	DMA_SECCFG_CH6_LOCK_MSB, 2
.equ	DMA_SECCFG_CH6_LOCK_LSB, 2
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_CH6_S
# Description : Secure channel. If 1, this channel performs Secure bus
#               accesses. If 0, it performs Non-secure bus accesses.
#
#               If 1, this channel is controllable only from a Secure context.
.equ	DMA_SECCFG_CH6_S_RESET, 0x1
.equ	DMA_SECCFG_CH6_S_BITS, 0x00000002
.equ	DMA_SECCFG_CH6_S_MSB, 1
.equ	DMA_SECCFG_CH6_S_LSB, 1
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_CH6_P
# Description : Privileged channel. If 1, this channel performs Privileged bus
#               accesses. If 0, it performs Unprivileged bus accesses.
#
#               If 1, this channel is controllable only from a Privileged
#               context of the same Secure/Non-secure level, or any context of
#               a higher Secure/Non-secure level.
.equ	DMA_SECCFG_CH6_P_RESET, 0x1
.equ	DMA_SECCFG_CH6_P_BITS, 0x00000001
.equ	DMA_SECCFG_CH6_P_MSB, 0
.equ	DMA_SECCFG_CH6_P_LSB, 0
# =============================================================================
# Register    : DMA_SECCFG_CH7
# Description : Security configuration for channel 7. Control whether this
#               channel performs Secure/Non-secure and Privileged/Unprivileged
#               bus accesses.
#
#               If this channel generates bus accesses of some security level,
#               an access of at least that level (in the order S+P > S+U > NS+P
#               > NS+U) is required to program, trigger, abort, check the
#               status of, interrupt on or acknowledge the interrupt of this
#               channel.
#
#               This register automatically locks down (becomes read-only) once
#               software starts to configure the channel.
#
#               This register is world-readable, but is writable only from a
#               Secure, Privileged context.
.equ	DMA_SECCFG_CH7_OFFSET, 0x0000049c
.equ	DMA_SECCFG_CH7_BITS, 0x00000007
.equ	DMA_SECCFG_CH7_RESET, 0x00000003
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_CH7_LOCK
# Description : LOCK is 0 at reset, and is set to 1 automatically upon a
#               successful write to this channel's control registers. That is,
#               a write to CTRL, READ_ADDR, WRITE_ADDR, TRANS_COUNT and their
#               aliases.
#
#               Once its LOCK bit is set, this register becomes read-only.
#
#               A failed write, for example due to the write's privilege being
#               lower than that specified in the channel's SECCFG register,
#               will not set the LOCK bit.
.equ	DMA_SECCFG_CH7_LOCK_RESET, 0x0
.equ	DMA_SECCFG_CH7_LOCK_BITS, 0x00000004
.equ	DMA_SECCFG_CH7_LOCK_MSB, 2
.equ	DMA_SECCFG_CH7_LOCK_LSB, 2
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_CH7_S
# Description : Secure channel. If 1, this channel performs Secure bus
#               accesses. If 0, it performs Non-secure bus accesses.
#
#               If 1, this channel is controllable only from a Secure context.
.equ	DMA_SECCFG_CH7_S_RESET, 0x1
.equ	DMA_SECCFG_CH7_S_BITS, 0x00000002
.equ	DMA_SECCFG_CH7_S_MSB, 1
.equ	DMA_SECCFG_CH7_S_LSB, 1
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_CH7_P
# Description : Privileged channel. If 1, this channel performs Privileged bus
#               accesses. If 0, it performs Unprivileged bus accesses.
#
#               If 1, this channel is controllable only from a Privileged
#               context of the same Secure/Non-secure level, or any context of
