konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/dma.inc
#               a higher Secure/Non-secure level.
.equ	DMA_SECCFG_CH7_P_RESET, 0x1
.equ	DMA_SECCFG_CH7_P_BITS, 0x00000001
.equ	DMA_SECCFG_CH7_P_MSB, 0
.equ	DMA_SECCFG_CH7_P_LSB, 0
# =============================================================================
# Register    : DMA_SECCFG_CH8
# Description : Security configuration for channel 8. Control whether this
#               channel performs Secure/Non-secure and Privileged/Unprivileged
#               bus accesses.
#
#               If this channel generates bus accesses of some security level,
#               an access of at least that level (in the order S+P > S+U > NS+P
#               > NS+U) is required to program, trigger, abort, check the
#               status of, interrupt on or acknowledge the interrupt of this
#               channel.
#
#               This register automatically locks down (becomes read-only) once
#               software starts to configure the channel.
#
#               This register is world-readable, but is writable only from a
#               Secure, Privileged context.
.equ	DMA_SECCFG_CH8_OFFSET, 0x000004a0
.equ	DMA_SECCFG_CH8_BITS, 0x00000007
.equ	DMA_SECCFG_CH8_RESET, 0x00000003
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_CH8_LOCK
# Description : LOCK is 0 at reset, and is set to 1 automatically upon a
#               successful write to this channel's control registers. That is,
#               a write to CTRL, READ_ADDR, WRITE_ADDR, TRANS_COUNT and their
#               aliases.
#
#               Once its LOCK bit is set, this register becomes read-only.
#
#               A failed write, for example due to the write's privilege being
#               lower than that specified in the channel's SECCFG register,
#               will not set the LOCK bit.
.equ	DMA_SECCFG_CH8_LOCK_RESET, 0x0
.equ	DMA_SECCFG_CH8_LOCK_BITS, 0x00000004
.equ	DMA_SECCFG_CH8_LOCK_MSB, 2
.equ	DMA_SECCFG_CH8_LOCK_LSB, 2
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_CH8_S
# Description : Secure channel. If 1, this channel performs Secure bus
#               accesses. If 0, it performs Non-secure bus accesses.
#
#               If 1, this channel is controllable only from a Secure context.
.equ	DMA_SECCFG_CH8_S_RESET, 0x1
.equ	DMA_SECCFG_CH8_S_BITS, 0x00000002
.equ	DMA_SECCFG_CH8_S_MSB, 1
.equ	DMA_SECCFG_CH8_S_LSB, 1
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_CH8_P
# Description : Privileged channel. If 1, this channel performs Privileged bus
#               accesses. If 0, it performs Unprivileged bus accesses.
#
#               If 1, this channel is controllable only from a Privileged
#               context of the same Secure/Non-secure level, or any context of
#               a higher Secure/Non-secure level.
.equ	DMA_SECCFG_CH8_P_RESET, 0x1
.equ	DMA_SECCFG_CH8_P_BITS, 0x00000001
.equ	DMA_SECCFG_CH8_P_MSB, 0
.equ	DMA_SECCFG_CH8_P_LSB, 0
# =============================================================================
# Register    : DMA_SECCFG_CH9
# Description : Security configuration for channel 9. Control whether this
#               channel performs Secure/Non-secure and Privileged/Unprivileged
#               bus accesses.
#
#               If this channel generates bus accesses of some security level,
#               an access of at least that level (in the order S+P > S+U > NS+P
#               > NS+U) is required to program, trigger, abort, check the
#               status of, interrupt on or acknowledge the interrupt of this
#               channel.
#
#               This register automatically locks down (becomes read-only) once
#               software starts to configure the channel.
#
#               This register is world-readable, but is writable only from a
#               Secure, Privileged context.
.equ	DMA_SECCFG_CH9_OFFSET, 0x000004a4
.equ	DMA_SECCFG_CH9_BITS, 0x00000007
.equ	DMA_SECCFG_CH9_RESET, 0x00000003
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_CH9_LOCK
# Description : LOCK is 0 at reset, and is set to 1 automatically upon a
#               successful write to this channel's control registers. That is,
#               a write to CTRL, READ_ADDR, WRITE_ADDR, TRANS_COUNT and their
#               aliases.
#
#               Once its LOCK bit is set, this register becomes read-only.
#
#               A failed write, for example due to the write's privilege being
#               lower than that specified in the channel's SECCFG register,
#               will not set the LOCK bit.
.equ	DMA_SECCFG_CH9_LOCK_RESET, 0x0
.equ	DMA_SECCFG_CH9_LOCK_BITS, 0x00000004
.equ	DMA_SECCFG_CH9_LOCK_MSB, 2
.equ	DMA_SECCFG_CH9_LOCK_LSB, 2
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_CH9_S
# Description : Secure channel. If 1, this channel performs Secure bus
#               accesses. If 0, it performs Non-secure bus accesses.
#
#               If 1, this channel is controllable only from a Secure context.
.equ	DMA_SECCFG_CH9_S_RESET, 0x1
.equ	DMA_SECCFG_CH9_S_BITS, 0x00000002
.equ	DMA_SECCFG_CH9_S_MSB, 1
.equ	DMA_SECCFG_CH9_S_LSB, 1
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_CH9_P
# Description : Privileged channel. If 1, this channel performs Privileged bus
#               accesses. If 0, it performs Unprivileged bus accesses.
#
#               If 1, this channel is controllable only from a Privileged
#               context of the same Secure/Non-secure level, or any context of
#               a higher Secure/Non-secure level.
.equ	DMA_SECCFG_CH9_P_RESET, 0x1
.equ	DMA_SECCFG_CH9_P_BITS, 0x00000001
.equ	DMA_SECCFG_CH9_P_MSB, 0
.equ	DMA_SECCFG_CH9_P_LSB, 0
# =============================================================================
# Register    : DMA_SECCFG_CH10
# Description : Security configuration for channel 10. Control whether this
#               channel performs Secure/Non-secure and Privileged/Unprivileged
#               bus accesses.
#
#               If this channel generates bus accesses of some security level,
#               an access of at least that level (in the order S+P > S+U > NS+P
#               > NS+U) is required to program, trigger, abort, check the
#               status of, interrupt on or acknowledge the interrupt of this
#               channel.
#
#               This register automatically locks down (becomes read-only) once
#               software starts to configure the channel.
#
#               This register is world-readable, but is writable only from a
#               Secure, Privileged context.
.equ	DMA_SECCFG_CH10_OFFSET, 0x000004a8
.equ	DMA_SECCFG_CH10_BITS, 0x00000007
.equ	DMA_SECCFG_CH10_RESET, 0x00000003
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_CH10_LOCK
# Description : LOCK is 0 at reset, and is set to 1 automatically upon a
#               successful write to this channel's control registers. That is,
#               a write to CTRL, READ_ADDR, WRITE_ADDR, TRANS_COUNT and their
#               aliases.
#
#               Once its LOCK bit is set, this register becomes read-only.
#
#               A failed write, for example due to the write's privilege being
#               lower than that specified in the channel's SECCFG register,
#               will not set the LOCK bit.
.equ	DMA_SECCFG_CH10_LOCK_RESET, 0x0
.equ	DMA_SECCFG_CH10_LOCK_BITS, 0x00000004
.equ	DMA_SECCFG_CH10_LOCK_MSB, 2
.equ	DMA_SECCFG_CH10_LOCK_LSB, 2
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_CH10_S
# Description : Secure channel. If 1, this channel performs Secure bus
#               accesses. If 0, it performs Non-secure bus accesses.
#
#               If 1, this channel is controllable only from a Secure context.
.equ	DMA_SECCFG_CH10_S_RESET, 0x1
.equ	DMA_SECCFG_CH10_S_BITS, 0x00000002
.equ	DMA_SECCFG_CH10_S_MSB, 1
.equ	DMA_SECCFG_CH10_S_LSB, 1
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_CH10_P
# Description : Privileged channel. If 1, this channel performs Privileged bus
#               accesses. If 0, it performs Unprivileged bus accesses.
#
#               If 1, this channel is controllable only from a Privileged
#               context of the same Secure/Non-secure level, or any context of
#               a higher Secure/Non-secure level.
.equ	DMA_SECCFG_CH10_P_RESET, 0x1
.equ	DMA_SECCFG_CH10_P_BITS, 0x00000001
.equ	DMA_SECCFG_CH10_P_MSB, 0
.equ	DMA_SECCFG_CH10_P_LSB, 0
# =============================================================================
# Register    : DMA_SECCFG_CH11
# Description : Security configuration for channel 11. Control whether this
#               channel performs Secure/Non-secure and Privileged/Unprivileged
#               bus accesses.
#
#               If this channel generates bus accesses of some security level,
#               an access of at least that level (in the order S+P > S+U > NS+P
#               > NS+U) is required to program, trigger, abort, check the
#               status of, interrupt on or acknowledge the interrupt of this
#               channel.
#
#               This register automatically locks down (becomes read-only) once
#               software starts to configure the channel.
#
#               This register is world-readable, but is writable only from a
#               Secure, Privileged context.
.equ	DMA_SECCFG_CH11_OFFSET, 0x000004ac
.equ	DMA_SECCFG_CH11_BITS, 0x00000007
.equ	DMA_SECCFG_CH11_RESET, 0x00000003
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_CH11_LOCK
# Description : LOCK is 0 at reset, and is set to 1 automatically upon a
#               successful write to this channel's control registers. That is,
#               a write to CTRL, READ_ADDR, WRITE_ADDR, TRANS_COUNT and their
#               aliases.
#
#               Once its LOCK bit is set, this register becomes read-only.
#
#               A failed write, for example due to the write's privilege being
#               lower than that specified in the channel's SECCFG register,
#               will not set the LOCK bit.
.equ	DMA_SECCFG_CH11_LOCK_RESET, 0x0
.equ	DMA_SECCFG_CH11_LOCK_BITS, 0x00000004
.equ	DMA_SECCFG_CH11_LOCK_MSB, 2
.equ	DMA_SECCFG_CH11_LOCK_LSB, 2
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_CH11_S
# Description : Secure channel. If 1, this channel performs Secure bus
#               accesses. If 0, it performs Non-secure bus accesses.
#
#               If 1, this channel is controllable only from a Secure context.
.equ	DMA_SECCFG_CH11_S_RESET, 0x1
.equ	DMA_SECCFG_CH11_S_BITS, 0x00000002
.equ	DMA_SECCFG_CH11_S_MSB, 1
.equ	DMA_SECCFG_CH11_S_LSB, 1
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_CH11_P
# Description : Privileged channel. If 1, this channel performs Privileged bus
#               accesses. If 0, it performs Unprivileged bus accesses.
#
#               If 1, this channel is controllable only from a Privileged
#               context of the same Secure/Non-secure level, or any context of
#               a higher Secure/Non-secure level.
.equ	DMA_SECCFG_CH11_P_RESET, 0x1
.equ	DMA_SECCFG_CH11_P_BITS, 0x00000001
.equ	DMA_SECCFG_CH11_P_MSB, 0
.equ	DMA_SECCFG_CH11_P_LSB, 0
# =============================================================================
# Register    : DMA_SECCFG_CH12
# Description : Security configuration for channel 12. Control whether this
#               channel performs Secure/Non-secure and Privileged/Unprivileged
#               bus accesses.
#
#               If this channel generates bus accesses of some security level,
#               an access of at least that level (in the order S+P > S+U > NS+P
#               > NS+U) is required to program, trigger, abort, check the
#               status of, interrupt on or acknowledge the interrupt of this
#               channel.
#
#               This register automatically locks down (becomes read-only) once
#               software starts to configure the channel.
#
#               This register is world-readable, but is writable only from a
#               Secure, Privileged context.
.equ	DMA_SECCFG_CH12_OFFSET, 0x000004b0
.equ	DMA_SECCFG_CH12_BITS, 0x00000007
.equ	DMA_SECCFG_CH12_RESET, 0x00000003
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_CH12_LOCK
# Description : LOCK is 0 at reset, and is set to 1 automatically upon a
#               successful write to this channel's control registers. That is,
#               a write to CTRL, READ_ADDR, WRITE_ADDR, TRANS_COUNT and their
#               aliases.
#
#               Once its LOCK bit is set, this register becomes read-only.
#
#               A failed write, for example due to the write's privilege being
#               lower than that specified in the channel's SECCFG register,
#               will not set the LOCK bit.
.equ	DMA_SECCFG_CH12_LOCK_RESET, 0x0
.equ	DMA_SECCFG_CH12_LOCK_BITS, 0x00000004
.equ	DMA_SECCFG_CH12_LOCK_MSB, 2
.equ	DMA_SECCFG_CH12_LOCK_LSB, 2
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_CH12_S
# Description : Secure channel. If 1, this channel performs Secure bus
#               accesses. If 0, it performs Non-secure bus accesses.
#
#               If 1, this channel is controllable only from a Secure context.
.equ	DMA_SECCFG_CH12_S_RESET, 0x1
.equ	DMA_SECCFG_CH12_S_BITS, 0x00000002
.equ	DMA_SECCFG_CH12_S_MSB, 1
.equ	DMA_SECCFG_CH12_S_LSB, 1
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_CH12_P
# Description : Privileged channel. If 1, this channel performs Privileged bus
#               accesses. If 0, it performs Unprivileged bus accesses.
#
#               If 1, this channel is controllable only from a Privileged
#               context of the same Secure/Non-secure level, or any context of
#               a higher Secure/Non-secure level.
.equ	DMA_SECCFG_CH12_P_RESET, 0x1
.equ	DMA_SECCFG_CH12_P_BITS, 0x00000001
.equ	DMA_SECCFG_CH12_P_MSB, 0
.equ	DMA_SECCFG_CH12_P_LSB, 0
# =============================================================================
# Register    : DMA_SECCFG_CH13
# Description : Security configuration for channel 13. Control whether this
#               channel performs Secure/Non-secure and Privileged/Unprivileged
#               bus accesses.
#
#               If this channel generates bus accesses of some security level,
#               an access of at least that level (in the order S+P > S+U > NS+P
#               > NS+U) is required to program, trigger, abort, check the
#               status of, interrupt on or acknowledge the interrupt of this
#               channel.
#
#               This register automatically locks down (becomes read-only) once
#               software starts to configure the channel.
#
#               This register is world-readable, but is writable only from a
#               Secure, Privileged context.
.equ	DMA_SECCFG_CH13_OFFSET, 0x000004b4
.equ	DMA_SECCFG_CH13_BITS, 0x00000007
.equ	DMA_SECCFG_CH13_RESET, 0x00000003
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_CH13_LOCK
# Description : LOCK is 0 at reset, and is set to 1 automatically upon a
#               successful write to this channel's control registers. That is,
#               a write to CTRL, READ_ADDR, WRITE_ADDR, TRANS_COUNT and their
#               aliases.
#
#               Once its LOCK bit is set, this register becomes read-only.
#
#               A failed write, for example due to the write's privilege being
#               lower than that specified in the channel's SECCFG register,
#               will not set the LOCK bit.
.equ	DMA_SECCFG_CH13_LOCK_RESET, 0x0
.equ	DMA_SECCFG_CH13_LOCK_BITS, 0x00000004
.equ	DMA_SECCFG_CH13_LOCK_MSB, 2
.equ	DMA_SECCFG_CH13_LOCK_LSB, 2
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_CH13_S
# Description : Secure channel. If 1, this channel performs Secure bus
#               accesses. If 0, it performs Non-secure bus accesses.
#
#               If 1, this channel is controllable only from a Secure context.
.equ	DMA_SECCFG_CH13_S_RESET, 0x1
.equ	DMA_SECCFG_CH13_S_BITS, 0x00000002
.equ	DMA_SECCFG_CH13_S_MSB, 1
.equ	DMA_SECCFG_CH13_S_LSB, 1
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_CH13_P
# Description : Privileged channel. If 1, this channel performs Privileged bus
#               accesses. If 0, it performs Unprivileged bus accesses.
#
#               If 1, this channel is controllable only from a Privileged
#               context of the same Secure/Non-secure level, or any context of
#               a higher Secure/Non-secure level.
.equ	DMA_SECCFG_CH13_P_RESET, 0x1
.equ	DMA_SECCFG_CH13_P_BITS, 0x00000001
.equ	DMA_SECCFG_CH13_P_MSB, 0
.equ	DMA_SECCFG_CH13_P_LSB, 0
# =============================================================================
# Register    : DMA_SECCFG_CH14
# Description : Security configuration for channel 14. Control whether this
#               channel performs Secure/Non-secure and Privileged/Unprivileged
#               bus accesses.
#
#               If this channel generates bus accesses of some security level,
#               an access of at least that level (in the order S+P > S+U > NS+P
#               > NS+U) is required to program, trigger, abort, check the
#               status of, interrupt on or acknowledge the interrupt of this
#               channel.
#
#               This register automatically locks down (becomes read-only) once
#               software starts to configure the channel.
#
#               This register is world-readable, but is writable only from a
#               Secure, Privileged context.
.equ	DMA_SECCFG_CH14_OFFSET, 0x000004b8
.equ	DMA_SECCFG_CH14_BITS, 0x00000007
.equ	DMA_SECCFG_CH14_RESET, 0x00000003
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_CH14_LOCK
# Description : LOCK is 0 at reset, and is set to 1 automatically upon a
#               successful write to this channel's control registers. That is,
#               a write to CTRL, READ_ADDR, WRITE_ADDR, TRANS_COUNT and their
#               aliases.
#
#               Once its LOCK bit is set, this register becomes read-only.
#
#               A failed write, for example due to the write's privilege being
#               lower than that specified in the channel's SECCFG register,
#               will not set the LOCK bit.
.equ	DMA_SECCFG_CH14_LOCK_RESET, 0x0
.equ	DMA_SECCFG_CH14_LOCK_BITS, 0x00000004
.equ	DMA_SECCFG_CH14_LOCK_MSB, 2
.equ	DMA_SECCFG_CH14_LOCK_LSB, 2
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_CH14_S
# Description : Secure channel. If 1, this channel performs Secure bus
#               accesses. If 0, it performs Non-secure bus accesses.
#
#               If 1, this channel is controllable only from a Secure context.
.equ	DMA_SECCFG_CH14_S_RESET, 0x1
.equ	DMA_SECCFG_CH14_S_BITS, 0x00000002
.equ	DMA_SECCFG_CH14_S_MSB, 1
.equ	DMA_SECCFG_CH14_S_LSB, 1
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_CH14_P
# Description : Privileged channel. If 1, this channel performs Privileged bus
#               accesses. If 0, it performs Unprivileged bus accesses.
#
#               If 1, this channel is controllable only from a Privileged
#               context of the same Secure/Non-secure level, or any context of
#               a higher Secure/Non-secure level.
.equ	DMA_SECCFG_CH14_P_RESET, 0x1
.equ	DMA_SECCFG_CH14_P_BITS, 0x00000001
.equ	DMA_SECCFG_CH14_P_MSB, 0
.equ	DMA_SECCFG_CH14_P_LSB, 0
# =============================================================================
# Register    : DMA_SECCFG_CH15
# Description : Security configuration for channel 15. Control whether this
#               channel performs Secure/Non-secure and Privileged/Unprivileged
#               bus accesses.
#
#               If this channel generates bus accesses of some security level,
#               an access of at least that level (in the order S+P > S+U > NS+P
#               > NS+U) is required to program, trigger, abort, check the
#               status of, interrupt on or acknowledge the interrupt of this
#               channel.
#
#               This register automatically locks down (becomes read-only) once
#               software starts to configure the channel.
#
#               This register is world-readable, but is writable only from a
#               Secure, Privileged context.
.equ	DMA_SECCFG_CH15_OFFSET, 0x000004bc
.equ	DMA_SECCFG_CH15_BITS, 0x00000007
.equ	DMA_SECCFG_CH15_RESET, 0x00000003
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_CH15_LOCK
# Description : LOCK is 0 at reset, and is set to 1 automatically upon a
#               successful write to this channel's control registers. That is,
#               a write to CTRL, READ_ADDR, WRITE_ADDR, TRANS_COUNT and their
#               aliases.
#
#               Once its LOCK bit is set, this register becomes read-only.
#
#               A failed write, for example due to the write's privilege being
#               lower than that specified in the channel's SECCFG register,
#               will not set the LOCK bit.
.equ	DMA_SECCFG_CH15_LOCK_RESET, 0x0
.equ	DMA_SECCFG_CH15_LOCK_BITS, 0x00000004
.equ	DMA_SECCFG_CH15_LOCK_MSB, 2
.equ	DMA_SECCFG_CH15_LOCK_LSB, 2
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_CH15_S
# Description : Secure channel. If 1, this channel performs Secure bus
#               accesses. If 0, it performs Non-secure bus accesses.
#
#               If 1, this channel is controllable only from a Secure context.
.equ	DMA_SECCFG_CH15_S_RESET, 0x1
.equ	DMA_SECCFG_CH15_S_BITS, 0x00000002
.equ	DMA_SECCFG_CH15_S_MSB, 1
.equ	DMA_SECCFG_CH15_S_LSB, 1
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_CH15_P
# Description : Privileged channel. If 1, this channel performs Privileged bus
#               accesses. If 0, it performs Unprivileged bus accesses.
#
#               If 1, this channel is controllable only from a Privileged
#               context of the same Secure/Non-secure level, or any context of
#               a higher Secure/Non-secure level.
.equ	DMA_SECCFG_CH15_P_RESET, 0x1
.equ	DMA_SECCFG_CH15_P_BITS, 0x00000001
.equ	DMA_SECCFG_CH15_P_MSB, 0
.equ	DMA_SECCFG_CH15_P_LSB, 0
# =============================================================================
# Register    : DMA_SECCFG_IRQ0
# Description : Security configuration for IRQ 0. Control whether the IRQ
#               permits configuration by Non-secure/Unprivileged contexts, and
#               whether it can observe Secure/Privileged channel interrupt
#               flags.
.equ	DMA_SECCFG_IRQ0_OFFSET, 0x000004c0
.equ	DMA_SECCFG_IRQ0_BITS, 0x00000003
.equ	DMA_SECCFG_IRQ0_RESET, 0x00000003
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_IRQ0_S
# Description : Secure IRQ. If 1, this IRQ's control registers can only be
#               accessed from a Secure context.
#
#               If 0, this IRQ's control registers can be accessed from a Non-
