konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/dma.inc
#               secure context, but Secure channels (as per SECCFG_CHx) are
#               masked from the IRQ status, and this IRQ's registers can not be
#               used to acknowledge the channel interrupts of Secure channels.
.equ	DMA_SECCFG_IRQ0_S_RESET, 0x1
.equ	DMA_SECCFG_IRQ0_S_BITS, 0x00000002
.equ	DMA_SECCFG_IRQ0_S_MSB, 1
.equ	DMA_SECCFG_IRQ0_S_LSB, 1
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_IRQ0_P
# Description : Privileged IRQ. If 1, this IRQ's control registers can only be
#               accessed from a Privileged context.
#
#               If 0, this IRQ's control registers can be accessed from an
#               Unprivileged context, but Privileged channels (as per
#               SECCFG_CHx) are masked from the IRQ status, and this IRQ's
#               registers can not be used to acknowledge the channel interrupts
#               of Privileged channels.
.equ	DMA_SECCFG_IRQ0_P_RESET, 0x1
.equ	DMA_SECCFG_IRQ0_P_BITS, 0x00000001
.equ	DMA_SECCFG_IRQ0_P_MSB, 0
.equ	DMA_SECCFG_IRQ0_P_LSB, 0
# =============================================================================
# Register    : DMA_SECCFG_IRQ1
# Description : Security configuration for IRQ 1. Control whether the IRQ
#               permits configuration by Non-secure/Unprivileged contexts, and
#               whether it can observe Secure/Privileged channel interrupt
#               flags.
.equ	DMA_SECCFG_IRQ1_OFFSET, 0x000004c4
.equ	DMA_SECCFG_IRQ1_BITS, 0x00000003
.equ	DMA_SECCFG_IRQ1_RESET, 0x00000003
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_IRQ1_S
# Description : Secure IRQ. If 1, this IRQ's control registers can only be
#               accessed from a Secure context.
#
#               If 0, this IRQ's control registers can be accessed from a Non-
#               secure context, but Secure channels (as per SECCFG_CHx) are
#               masked from the IRQ status, and this IRQ's registers can not be
#               used to acknowledge the channel interrupts of Secure channels.
.equ	DMA_SECCFG_IRQ1_S_RESET, 0x1
.equ	DMA_SECCFG_IRQ1_S_BITS, 0x00000002
.equ	DMA_SECCFG_IRQ1_S_MSB, 1
.equ	DMA_SECCFG_IRQ1_S_LSB, 1
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_IRQ1_P
# Description : Privileged IRQ. If 1, this IRQ's control registers can only be
#               accessed from a Privileged context.
#
#               If 0, this IRQ's control registers can be accessed from an
#               Unprivileged context, but Privileged channels (as per
#               SECCFG_CHx) are masked from the IRQ status, and this IRQ's
#               registers can not be used to acknowledge the channel interrupts
#               of Privileged channels.
.equ	DMA_SECCFG_IRQ1_P_RESET, 0x1
.equ	DMA_SECCFG_IRQ1_P_BITS, 0x00000001
.equ	DMA_SECCFG_IRQ1_P_MSB, 0
.equ	DMA_SECCFG_IRQ1_P_LSB, 0
# =============================================================================
# Register    : DMA_SECCFG_IRQ2
# Description : Security configuration for IRQ 2. Control whether the IRQ
#               permits configuration by Non-secure/Unprivileged contexts, and
#               whether it can observe Secure/Privileged channel interrupt
#               flags.
.equ	DMA_SECCFG_IRQ2_OFFSET, 0x000004c8
.equ	DMA_SECCFG_IRQ2_BITS, 0x00000003
.equ	DMA_SECCFG_IRQ2_RESET, 0x00000003
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_IRQ2_S
# Description : Secure IRQ. If 1, this IRQ's control registers can only be
#               accessed from a Secure context.
#
#               If 0, this IRQ's control registers can be accessed from a Non-
#               secure context, but Secure channels (as per SECCFG_CHx) are
#               masked from the IRQ status, and this IRQ's registers can not be
#               used to acknowledge the channel interrupts of Secure channels.
.equ	DMA_SECCFG_IRQ2_S_RESET, 0x1
.equ	DMA_SECCFG_IRQ2_S_BITS, 0x00000002
.equ	DMA_SECCFG_IRQ2_S_MSB, 1
.equ	DMA_SECCFG_IRQ2_S_LSB, 1
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_IRQ2_P
# Description : Privileged IRQ. If 1, this IRQ's control registers can only be
#               accessed from a Privileged context.
#
#               If 0, this IRQ's control registers can be accessed from an
#               Unprivileged context, but Privileged channels (as per
#               SECCFG_CHx) are masked from the IRQ status, and this IRQ's
#               registers can not be used to acknowledge the channel interrupts
#               of Privileged channels.
.equ	DMA_SECCFG_IRQ2_P_RESET, 0x1
.equ	DMA_SECCFG_IRQ2_P_BITS, 0x00000001
.equ	DMA_SECCFG_IRQ2_P_MSB, 0
.equ	DMA_SECCFG_IRQ2_P_LSB, 0
# =============================================================================
# Register    : DMA_SECCFG_IRQ3
# Description : Security configuration for IRQ 3. Control whether the IRQ
#               permits configuration by Non-secure/Unprivileged contexts, and
#               whether it can observe Secure/Privileged channel interrupt
#               flags.
.equ	DMA_SECCFG_IRQ3_OFFSET, 0x000004cc
.equ	DMA_SECCFG_IRQ3_BITS, 0x00000003
.equ	DMA_SECCFG_IRQ3_RESET, 0x00000003
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_IRQ3_S
# Description : Secure IRQ. If 1, this IRQ's control registers can only be
#               accessed from a Secure context.
#
#               If 0, this IRQ's control registers can be accessed from a Non-
#               secure context, but Secure channels (as per SECCFG_CHx) are
#               masked from the IRQ status, and this IRQ's registers can not be
#               used to acknowledge the channel interrupts of Secure channels.
.equ	DMA_SECCFG_IRQ3_S_RESET, 0x1
.equ	DMA_SECCFG_IRQ3_S_BITS, 0x00000002
.equ	DMA_SECCFG_IRQ3_S_MSB, 1
.equ	DMA_SECCFG_IRQ3_S_LSB, 1
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_IRQ3_P
# Description : Privileged IRQ. If 1, this IRQ's control registers can only be
#               accessed from a Privileged context.
#
#               If 0, this IRQ's control registers can be accessed from an
#               Unprivileged context, but Privileged channels (as per
#               SECCFG_CHx) are masked from the IRQ status, and this IRQ's
#               registers can not be used to acknowledge the channel interrupts
#               of Privileged channels.
.equ	DMA_SECCFG_IRQ3_P_RESET, 0x1
.equ	DMA_SECCFG_IRQ3_P_BITS, 0x00000001
.equ	DMA_SECCFG_IRQ3_P_MSB, 0
.equ	DMA_SECCFG_IRQ3_P_LSB, 0
# =============================================================================
# Register    : DMA_SECCFG_MISC
# Description : Miscellaneous security configuration
.equ	DMA_SECCFG_MISC_OFFSET, 0x000004d0
.equ	DMA_SECCFG_MISC_BITS, 0x000003ff
.equ	DMA_SECCFG_MISC_RESET, 0x000003ff
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_MISC_TIMER3_S
# Description : If 1, the TIMER3 register is only accessible from a Secure
#               context, and timer DREQ 3 is only visible to Secure channels.
.equ	DMA_SECCFG_MISC_TIMER3_S_RESET, 0x1
.equ	DMA_SECCFG_MISC_TIMER3_S_BITS, 0x00000200
.equ	DMA_SECCFG_MISC_TIMER3_S_MSB, 9
.equ	DMA_SECCFG_MISC_TIMER3_S_LSB, 9
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_MISC_TIMER3_P
# Description : If 1, the TIMER3 register is only accessible from a Privileged
#               (or more Secure) context, and timer DREQ 3 is only visible to
#               Privileged (or more Secure) channels.
.equ	DMA_SECCFG_MISC_TIMER3_P_RESET, 0x1
.equ	DMA_SECCFG_MISC_TIMER3_P_BITS, 0x00000100
.equ	DMA_SECCFG_MISC_TIMER3_P_MSB, 8
.equ	DMA_SECCFG_MISC_TIMER3_P_LSB, 8
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_MISC_TIMER2_S
# Description : If 1, the TIMER2 register is only accessible from a Secure
#               context, and timer DREQ 2 is only visible to Secure channels.
.equ	DMA_SECCFG_MISC_TIMER2_S_RESET, 0x1
.equ	DMA_SECCFG_MISC_TIMER2_S_BITS, 0x00000080
.equ	DMA_SECCFG_MISC_TIMER2_S_MSB, 7
.equ	DMA_SECCFG_MISC_TIMER2_S_LSB, 7
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_MISC_TIMER2_P
# Description : If 1, the TIMER2 register is only accessible from a Privileged
#               (or more Secure) context, and timer DREQ 2 is only visible to
#               Privileged (or more Secure) channels.
.equ	DMA_SECCFG_MISC_TIMER2_P_RESET, 0x1
.equ	DMA_SECCFG_MISC_TIMER2_P_BITS, 0x00000040
.equ	DMA_SECCFG_MISC_TIMER2_P_MSB, 6
.equ	DMA_SECCFG_MISC_TIMER2_P_LSB, 6
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_MISC_TIMER1_S
# Description : If 1, the TIMER1 register is only accessible from a Secure
#               context, and timer DREQ 1 is only visible to Secure channels.
.equ	DMA_SECCFG_MISC_TIMER1_S_RESET, 0x1
.equ	DMA_SECCFG_MISC_TIMER1_S_BITS, 0x00000020
.equ	DMA_SECCFG_MISC_TIMER1_S_MSB, 5
.equ	DMA_SECCFG_MISC_TIMER1_S_LSB, 5
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_MISC_TIMER1_P
# Description : If 1, the TIMER1 register is only accessible from a Privileged
#               (or more Secure) context, and timer DREQ 1 is only visible to
#               Privileged (or more Secure) channels.
.equ	DMA_SECCFG_MISC_TIMER1_P_RESET, 0x1
.equ	DMA_SECCFG_MISC_TIMER1_P_BITS, 0x00000010
.equ	DMA_SECCFG_MISC_TIMER1_P_MSB, 4
.equ	DMA_SECCFG_MISC_TIMER1_P_LSB, 4
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_MISC_TIMER0_S
# Description : If 1, the TIMER0 register is only accessible from a Secure
#               context, and timer DREQ 0 is only visible to Secure channels.
.equ	DMA_SECCFG_MISC_TIMER0_S_RESET, 0x1
.equ	DMA_SECCFG_MISC_TIMER0_S_BITS, 0x00000008
.equ	DMA_SECCFG_MISC_TIMER0_S_MSB, 3
.equ	DMA_SECCFG_MISC_TIMER0_S_LSB, 3
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_MISC_TIMER0_P
# Description : If 1, the TIMER0 register is only accessible from a Privileged
#               (or more Secure) context, and timer DREQ 0 is only visible to
#               Privileged (or more Secure) channels.
.equ	DMA_SECCFG_MISC_TIMER0_P_RESET, 0x1
.equ	DMA_SECCFG_MISC_TIMER0_P_BITS, 0x00000004
.equ	DMA_SECCFG_MISC_TIMER0_P_MSB, 2
.equ	DMA_SECCFG_MISC_TIMER0_P_LSB, 2
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_MISC_SNIFF_S
# Description : If 1, the sniffer can see data transfers from Secure channels,
#               and can itself only be accessed from a Secure context.
#
#               If 0, the sniffer can be accessed from either a Secure or Non-
#               secure context, but can not see data transfers of Secure
#               channels.
.equ	DMA_SECCFG_MISC_SNIFF_S_RESET, 0x1
.equ	DMA_SECCFG_MISC_SNIFF_S_BITS, 0x00000002
.equ	DMA_SECCFG_MISC_SNIFF_S_MSB, 1
.equ	DMA_SECCFG_MISC_SNIFF_S_LSB, 1
# -----------------------------------------------------------------------------
# Field       : DMA_SECCFG_MISC_SNIFF_P
# Description : If 1, the sniffer can see data transfers from Privileged
#               channels, and can itself only be accessed from a privileged
#               context, or from a Secure context when SNIFF_S is 0.
#
#               If 0, the sniffer can be accessed from either a Privileged or
#               Unprivileged context (with sufficient security level) but can
#               not see transfers from Privileged channels.
.equ	DMA_SECCFG_MISC_SNIFF_P_RESET, 0x1
.equ	DMA_SECCFG_MISC_SNIFF_P_BITS, 0x00000001
.equ	DMA_SECCFG_MISC_SNIFF_P_MSB, 0
.equ	DMA_SECCFG_MISC_SNIFF_P_LSB, 0
# =============================================================================
# Register    : DMA_MPU_CTRL
# Description : Control register for DMA MPU. Accessible only from a Privileged
#               context.
.equ	DMA_MPU_CTRL_OFFSET, 0x00000500
.equ	DMA_MPU_CTRL_BITS, 0x0000000e
.equ	DMA_MPU_CTRL_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : DMA_MPU_CTRL_NS_HIDE_ADDR
# Description : By default, when a region's S bit is clear, Non-secure-
#               Privileged reads can see the region's base address and limit
#               address. Set this bit to make the addresses appear as 0 to Non-
#               secure reads, even when the region is Non-secure, to avoid
#               leaking information about the processor SAU map.
.equ	DMA_MPU_CTRL_NS_HIDE_ADDR_RESET, 0x0
.equ	DMA_MPU_CTRL_NS_HIDE_ADDR_BITS, 0x00000008
.equ	DMA_MPU_CTRL_NS_HIDE_ADDR_MSB, 3
.equ	DMA_MPU_CTRL_NS_HIDE_ADDR_LSB, 3
# -----------------------------------------------------------------------------
# Field       : DMA_MPU_CTRL_S
# Description : Determine whether an address not covered by an active MPU
#               region is Secure (1) or Non-secure (0)
.equ	DMA_MPU_CTRL_S_RESET, 0x0
.equ	DMA_MPU_CTRL_S_BITS, 0x00000004
.equ	DMA_MPU_CTRL_S_MSB, 2
.equ	DMA_MPU_CTRL_S_LSB, 2
# -----------------------------------------------------------------------------
# Field       : DMA_MPU_CTRL_P
# Description : Determine whether an address not covered by an active MPU
#               region is Privileged (1) or Unprivileged (0)
.equ	DMA_MPU_CTRL_P_RESET, 0x0
.equ	DMA_MPU_CTRL_P_BITS, 0x00000002
.equ	DMA_MPU_CTRL_P_MSB, 1
.equ	DMA_MPU_CTRL_P_LSB, 1
# =============================================================================
# Register    : DMA_MPU_BAR0
# Description : Base address register for MPU region 0. Writable only from a
#               Secure, Privileged context.
.equ	DMA_MPU_BAR0_OFFSET, 0x00000504
.equ	DMA_MPU_BAR0_BITS, 0xffffffe0
.equ	DMA_MPU_BAR0_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : DMA_MPU_BAR0_ADDR
# Description : This MPU region matches addresses where addr[31:5] (the 27 most
#               significant bits) are greater than or equal to BAR_ADDR, and
#               less than or equal to LAR_ADDR.
#
#               Readable from any Privileged context, if and only if this
#               region's S bit is clear, and MPU_CTRL_NS_HIDE_ADDR is clear.
#               Otherwise readable only from a Secure, Privileged context.
.equ	DMA_MPU_BAR0_ADDR_RESET, 0x0000000
.equ	DMA_MPU_BAR0_ADDR_BITS, 0xffffffe0
.equ	DMA_MPU_BAR0_ADDR_MSB, 31
.equ	DMA_MPU_BAR0_ADDR_LSB, 5
# =============================================================================
# Register    : DMA_MPU_LAR0
# Description : Limit address register for MPU region 0. Writable only from a
#               Secure, Privileged context, with the exception of the P bit.
.equ	DMA_MPU_LAR0_OFFSET, 0x00000508
.equ	DMA_MPU_LAR0_BITS, 0xffffffe7
.equ	DMA_MPU_LAR0_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : DMA_MPU_LAR0_ADDR
# Description : Limit address bits 31:5. Readable from any Privileged context,
#               if and only if this region's S bit is clear, and
#               MPU_CTRL_NS_HIDE_ADDR is clear. Otherwise readable only from a
#               Secure, Privileged context.
.equ	DMA_MPU_LAR0_ADDR_RESET, 0x0000000
.equ	DMA_MPU_LAR0_ADDR_BITS, 0xffffffe0
.equ	DMA_MPU_LAR0_ADDR_MSB, 31
.equ	DMA_MPU_LAR0_ADDR_LSB, 5
# -----------------------------------------------------------------------------
# Field       : DMA_MPU_LAR0_S
# Description : Determines the Secure/Non-secure (=1/0) status of addresses
#               matching this region, if this region is enabled.
.equ	DMA_MPU_LAR0_S_RESET, 0x0
.equ	DMA_MPU_LAR0_S_BITS, 0x00000004
.equ	DMA_MPU_LAR0_S_MSB, 2
.equ	DMA_MPU_LAR0_S_LSB, 2
# -----------------------------------------------------------------------------
# Field       : DMA_MPU_LAR0_P
# Description : Determines the Privileged/Unprivileged (=1/0) status of
#               addresses matching this region, if this region is enabled.
#               Writable from any Privileged context, if and only if the S bit
#               is clear. Otherwise, writable only from a Secure, Privileged
#               context.
.equ	DMA_MPU_LAR0_P_RESET, 0x0
.equ	DMA_MPU_LAR0_P_BITS, 0x00000002
.equ	DMA_MPU_LAR0_P_MSB, 1
.equ	DMA_MPU_LAR0_P_LSB, 1
# -----------------------------------------------------------------------------
# Field       : DMA_MPU_LAR0_EN
# Description : Region enable. If 1, any address within range specified by the
#               base address (BAR_ADDR) and limit address (LAR_ADDR) has the
#               attributes specified by S and P.
.equ	DMA_MPU_LAR0_EN_RESET, 0x0
.equ	DMA_MPU_LAR0_EN_BITS, 0x00000001
.equ	DMA_MPU_LAR0_EN_MSB, 0
.equ	DMA_MPU_LAR0_EN_LSB, 0
# =============================================================================
# Register    : DMA_MPU_BAR1
# Description : Base address register for MPU region 1. Writable only from a
#               Secure, Privileged context.
.equ	DMA_MPU_BAR1_OFFSET, 0x0000050c
.equ	DMA_MPU_BAR1_BITS, 0xffffffe0
.equ	DMA_MPU_BAR1_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : DMA_MPU_BAR1_ADDR
# Description : This MPU region matches addresses where addr[31:5] (the 27 most
#               significant bits) are greater than or equal to BAR_ADDR, and
#               less than or equal to LAR_ADDR.
#
#               Readable from any Privileged context, if and only if this
#               region's S bit is clear, and MPU_CTRL_NS_HIDE_ADDR is clear.
#               Otherwise readable only from a Secure, Privileged context.
.equ	DMA_MPU_BAR1_ADDR_RESET, 0x0000000
.equ	DMA_MPU_BAR1_ADDR_BITS, 0xffffffe0
.equ	DMA_MPU_BAR1_ADDR_MSB, 31
.equ	DMA_MPU_BAR1_ADDR_LSB, 5
# =============================================================================
# Register    : DMA_MPU_LAR1
# Description : Limit address register for MPU region 1. Writable only from a
#               Secure, Privileged context, with the exception of the P bit.
.equ	DMA_MPU_LAR1_OFFSET, 0x00000510
.equ	DMA_MPU_LAR1_BITS, 0xffffffe7
.equ	DMA_MPU_LAR1_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : DMA_MPU_LAR1_ADDR
# Description : Limit address bits 31:5. Readable from any Privileged context,
#               if and only if this region's S bit is clear, and
#               MPU_CTRL_NS_HIDE_ADDR is clear. Otherwise readable only from a
#               Secure, Privileged context.
.equ	DMA_MPU_LAR1_ADDR_RESET, 0x0000000
.equ	DMA_MPU_LAR1_ADDR_BITS, 0xffffffe0
.equ	DMA_MPU_LAR1_ADDR_MSB, 31
.equ	DMA_MPU_LAR1_ADDR_LSB, 5
# -----------------------------------------------------------------------------
# Field       : DMA_MPU_LAR1_S
# Description : Determines the Secure/Non-secure (=1/0) status of addresses
#               matching this region, if this region is enabled.
.equ	DMA_MPU_LAR1_S_RESET, 0x0
.equ	DMA_MPU_LAR1_S_BITS, 0x00000004
.equ	DMA_MPU_LAR1_S_MSB, 2
.equ	DMA_MPU_LAR1_S_LSB, 2
# -----------------------------------------------------------------------------
# Field       : DMA_MPU_LAR1_P
# Description : Determines the Privileged/Unprivileged (=1/0) status of
#               addresses matching this region, if this region is enabled.
#               Writable from any Privileged context, if and only if the S bit
#               is clear. Otherwise, writable only from a Secure, Privileged
#               context.
.equ	DMA_MPU_LAR1_P_RESET, 0x0
.equ	DMA_MPU_LAR1_P_BITS, 0x00000002
.equ	DMA_MPU_LAR1_P_MSB, 1
.equ	DMA_MPU_LAR1_P_LSB, 1
# -----------------------------------------------------------------------------
# Field       : DMA_MPU_LAR1_EN
# Description : Region enable. If 1, any address within range specified by the
#               base address (BAR_ADDR) and limit address (LAR_ADDR) has the
#               attributes specified by S and P.
.equ	DMA_MPU_LAR1_EN_RESET, 0x0
.equ	DMA_MPU_LAR1_EN_BITS, 0x00000001
.equ	DMA_MPU_LAR1_EN_MSB, 0
.equ	DMA_MPU_LAR1_EN_LSB, 0
# =============================================================================
# Register    : DMA_MPU_BAR2
# Description : Base address register for MPU region 2. Writable only from a
#               Secure, Privileged context.
.equ	DMA_MPU_BAR2_OFFSET, 0x00000514
.equ	DMA_MPU_BAR2_BITS, 0xffffffe0
.equ	DMA_MPU_BAR2_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : DMA_MPU_BAR2_ADDR
# Description : This MPU region matches addresses where addr[31:5] (the 27 most
#               significant bits) are greater than or equal to BAR_ADDR, and
#               less than or equal to LAR_ADDR.
#
#               Readable from any Privileged context, if and only if this
#               region's S bit is clear, and MPU_CTRL_NS_HIDE_ADDR is clear.
#               Otherwise readable only from a Secure, Privileged context.
.equ	DMA_MPU_BAR2_ADDR_RESET, 0x0000000
.equ	DMA_MPU_BAR2_ADDR_BITS, 0xffffffe0
.equ	DMA_MPU_BAR2_ADDR_MSB, 31
.equ	DMA_MPU_BAR2_ADDR_LSB, 5
# =============================================================================
# Register    : DMA_MPU_LAR2
# Description : Limit address register for MPU region 2. Writable only from a
#               Secure, Privileged context, with the exception of the P bit.
.equ	DMA_MPU_LAR2_OFFSET, 0x00000518
.equ	DMA_MPU_LAR2_BITS, 0xffffffe7
.equ	DMA_MPU_LAR2_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : DMA_MPU_LAR2_ADDR
# Description : Limit address bits 31:5. Readable from any Privileged context,
#               if and only if this region's S bit is clear, and
#               MPU_CTRL_NS_HIDE_ADDR is clear. Otherwise readable only from a
#               Secure, Privileged context.
.equ	DMA_MPU_LAR2_ADDR_RESET, 0x0000000
.equ	DMA_MPU_LAR2_ADDR_BITS, 0xffffffe0
.equ	DMA_MPU_LAR2_ADDR_MSB, 31
.equ	DMA_MPU_LAR2_ADDR_LSB, 5
# -----------------------------------------------------------------------------
# Field       : DMA_MPU_LAR2_S
# Description : Determines the Secure/Non-secure (=1/0) status of addresses
#               matching this region, if this region is enabled.
.equ	DMA_MPU_LAR2_S_RESET, 0x0
.equ	DMA_MPU_LAR2_S_BITS, 0x00000004
.equ	DMA_MPU_LAR2_S_MSB, 2
.equ	DMA_MPU_LAR2_S_LSB, 2
# -----------------------------------------------------------------------------
# Field       : DMA_MPU_LAR2_P
# Description : Determines the Privileged/Unprivileged (=1/0) status of
#               addresses matching this region, if this region is enabled.
#               Writable from any Privileged context, if and only if the S bit
#               is clear. Otherwise, writable only from a Secure, Privileged
#               context.
.equ	DMA_MPU_LAR2_P_RESET, 0x0
.equ	DMA_MPU_LAR2_P_BITS, 0x00000002
.equ	DMA_MPU_LAR2_P_MSB, 1
.equ	DMA_MPU_LAR2_P_LSB, 1
# -----------------------------------------------------------------------------
# Field       : DMA_MPU_LAR2_EN
# Description : Region enable. If 1, any address within range specified by the
#               base address (BAR_ADDR) and limit address (LAR_ADDR) has the
#               attributes specified by S and P.
.equ	DMA_MPU_LAR2_EN_RESET, 0x0
.equ	DMA_MPU_LAR2_EN_BITS, 0x00000001
.equ	DMA_MPU_LAR2_EN_MSB, 0
.equ	DMA_MPU_LAR2_EN_LSB, 0
# =============================================================================
# Register    : DMA_MPU_BAR3
# Description : Base address register for MPU region 3. Writable only from a
#               Secure, Privileged context.
.equ	DMA_MPU_BAR3_OFFSET, 0x0000051c
.equ	DMA_MPU_BAR3_BITS, 0xffffffe0
