konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/dma.inc
.equ	DMA_MPU_BAR3_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : DMA_MPU_BAR3_ADDR
# Description : This MPU region matches addresses where addr[31:5] (the 27 most
#               significant bits) are greater than or equal to BAR_ADDR, and
#               less than or equal to LAR_ADDR.
#
#               Readable from any Privileged context, if and only if this
#               region's S bit is clear, and MPU_CTRL_NS_HIDE_ADDR is clear.
#               Otherwise readable only from a Secure, Privileged context.
.equ	DMA_MPU_BAR3_ADDR_RESET, 0x0000000
.equ	DMA_MPU_BAR3_ADDR_BITS, 0xffffffe0
.equ	DMA_MPU_BAR3_ADDR_MSB, 31
.equ	DMA_MPU_BAR3_ADDR_LSB, 5
# =============================================================================
# Register    : DMA_MPU_LAR3
# Description : Limit address register for MPU region 3. Writable only from a
#               Secure, Privileged context, with the exception of the P bit.
.equ	DMA_MPU_LAR3_OFFSET, 0x00000520
.equ	DMA_MPU_LAR3_BITS, 0xffffffe7
.equ	DMA_MPU_LAR3_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : DMA_MPU_LAR3_ADDR
# Description : Limit address bits 31:5. Readable from any Privileged context,
#               if and only if this region's S bit is clear, and
#               MPU_CTRL_NS_HIDE_ADDR is clear. Otherwise readable only from a
#               Secure, Privileged context.
.equ	DMA_MPU_LAR3_ADDR_RESET, 0x0000000
.equ	DMA_MPU_LAR3_ADDR_BITS, 0xffffffe0
.equ	DMA_MPU_LAR3_ADDR_MSB, 31
.equ	DMA_MPU_LAR3_ADDR_LSB, 5
# -----------------------------------------------------------------------------
# Field       : DMA_MPU_LAR3_S
# Description : Determines the Secure/Non-secure (=1/0) status of addresses
#               matching this region, if this region is enabled.
.equ	DMA_MPU_LAR3_S_RESET, 0x0
.equ	DMA_MPU_LAR3_S_BITS, 0x00000004
.equ	DMA_MPU_LAR3_S_MSB, 2
.equ	DMA_MPU_LAR3_S_LSB, 2
# -----------------------------------------------------------------------------
# Field       : DMA_MPU_LAR3_P
# Description : Determines the Privileged/Unprivileged (=1/0) status of
#               addresses matching this region, if this region is enabled.
#               Writable from any Privileged context, if and only if the S bit
#               is clear. Otherwise, writable only from a Secure, Privileged
#               context.
.equ	DMA_MPU_LAR3_P_RESET, 0x0
.equ	DMA_MPU_LAR3_P_BITS, 0x00000002
.equ	DMA_MPU_LAR3_P_MSB, 1
.equ	DMA_MPU_LAR3_P_LSB, 1
# -----------------------------------------------------------------------------
# Field       : DMA_MPU_LAR3_EN
# Description : Region enable. If 1, any address within range specified by the
#               base address (BAR_ADDR) and limit address (LAR_ADDR) has the
#               attributes specified by S and P.
.equ	DMA_MPU_LAR3_EN_RESET, 0x0
.equ	DMA_MPU_LAR3_EN_BITS, 0x00000001
.equ	DMA_MPU_LAR3_EN_MSB, 0
.equ	DMA_MPU_LAR3_EN_LSB, 0
# =============================================================================
# Register    : DMA_MPU_BAR4
# Description : Base address register for MPU region 4. Writable only from a
#               Secure, Privileged context.
.equ	DMA_MPU_BAR4_OFFSET, 0x00000524
.equ	DMA_MPU_BAR4_BITS, 0xffffffe0
.equ	DMA_MPU_BAR4_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : DMA_MPU_BAR4_ADDR
# Description : This MPU region matches addresses where addr[31:5] (the 27 most
#               significant bits) are greater than or equal to BAR_ADDR, and
#               less than or equal to LAR_ADDR.
#
#               Readable from any Privileged context, if and only if this
#               region's S bit is clear, and MPU_CTRL_NS_HIDE_ADDR is clear.
#               Otherwise readable only from a Secure, Privileged context.
.equ	DMA_MPU_BAR4_ADDR_RESET, 0x0000000
.equ	DMA_MPU_BAR4_ADDR_BITS, 0xffffffe0
.equ	DMA_MPU_BAR4_ADDR_MSB, 31
.equ	DMA_MPU_BAR4_ADDR_LSB, 5
# =============================================================================
# Register    : DMA_MPU_LAR4
# Description : Limit address register for MPU region 4. Writable only from a
#               Secure, Privileged context, with the exception of the P bit.
.equ	DMA_MPU_LAR4_OFFSET, 0x00000528
.equ	DMA_MPU_LAR4_BITS, 0xffffffe7
.equ	DMA_MPU_LAR4_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : DMA_MPU_LAR4_ADDR
# Description : Limit address bits 31:5. Readable from any Privileged context,
#               if and only if this region's S bit is clear, and
#               MPU_CTRL_NS_HIDE_ADDR is clear. Otherwise readable only from a
#               Secure, Privileged context.
.equ	DMA_MPU_LAR4_ADDR_RESET, 0x0000000
.equ	DMA_MPU_LAR4_ADDR_BITS, 0xffffffe0
.equ	DMA_MPU_LAR4_ADDR_MSB, 31
.equ	DMA_MPU_LAR4_ADDR_LSB, 5
# -----------------------------------------------------------------------------
# Field       : DMA_MPU_LAR4_S
# Description : Determines the Secure/Non-secure (=1/0) status of addresses
#               matching this region, if this region is enabled.
.equ	DMA_MPU_LAR4_S_RESET, 0x0
.equ	DMA_MPU_LAR4_S_BITS, 0x00000004
.equ	DMA_MPU_LAR4_S_MSB, 2
.equ	DMA_MPU_LAR4_S_LSB, 2
# -----------------------------------------------------------------------------
# Field       : DMA_MPU_LAR4_P
# Description : Determines the Privileged/Unprivileged (=1/0) status of
#               addresses matching this region, if this region is enabled.
#               Writable from any Privileged context, if and only if the S bit
#               is clear. Otherwise, writable only from a Secure, Privileged
#               context.
.equ	DMA_MPU_LAR4_P_RESET, 0x0
.equ	DMA_MPU_LAR4_P_BITS, 0x00000002
.equ	DMA_MPU_LAR4_P_MSB, 1
.equ	DMA_MPU_LAR4_P_LSB, 1
# -----------------------------------------------------------------------------
# Field       : DMA_MPU_LAR4_EN
# Description : Region enable. If 1, any address within range specified by the
#               base address (BAR_ADDR) and limit address (LAR_ADDR) has the
#               attributes specified by S and P.
.equ	DMA_MPU_LAR4_EN_RESET, 0x0
.equ	DMA_MPU_LAR4_EN_BITS, 0x00000001
.equ	DMA_MPU_LAR4_EN_MSB, 0
.equ	DMA_MPU_LAR4_EN_LSB, 0
# =============================================================================
# Register    : DMA_MPU_BAR5
# Description : Base address register for MPU region 5. Writable only from a
#               Secure, Privileged context.
.equ	DMA_MPU_BAR5_OFFSET, 0x0000052c
.equ	DMA_MPU_BAR5_BITS, 0xffffffe0
.equ	DMA_MPU_BAR5_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : DMA_MPU_BAR5_ADDR
# Description : This MPU region matches addresses where addr[31:5] (the 27 most
#               significant bits) are greater than or equal to BAR_ADDR, and
#               less than or equal to LAR_ADDR.
#
#               Readable from any Privileged context, if and only if this
#               region's S bit is clear, and MPU_CTRL_NS_HIDE_ADDR is clear.
#               Otherwise readable only from a Secure, Privileged context.
.equ	DMA_MPU_BAR5_ADDR_RESET, 0x0000000
.equ	DMA_MPU_BAR5_ADDR_BITS, 0xffffffe0
.equ	DMA_MPU_BAR5_ADDR_MSB, 31
.equ	DMA_MPU_BAR5_ADDR_LSB, 5
# =============================================================================
# Register    : DMA_MPU_LAR5
# Description : Limit address register for MPU region 5. Writable only from a
#               Secure, Privileged context, with the exception of the P bit.
.equ	DMA_MPU_LAR5_OFFSET, 0x00000530
.equ	DMA_MPU_LAR5_BITS, 0xffffffe7
.equ	DMA_MPU_LAR5_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : DMA_MPU_LAR5_ADDR
# Description : Limit address bits 31:5. Readable from any Privileged context,
#               if and only if this region's S bit is clear, and
#               MPU_CTRL_NS_HIDE_ADDR is clear. Otherwise readable only from a
#               Secure, Privileged context.
.equ	DMA_MPU_LAR5_ADDR_RESET, 0x0000000
.equ	DMA_MPU_LAR5_ADDR_BITS, 0xffffffe0
.equ	DMA_MPU_LAR5_ADDR_MSB, 31
.equ	DMA_MPU_LAR5_ADDR_LSB, 5
# -----------------------------------------------------------------------------
# Field       : DMA_MPU_LAR5_S
# Description : Determines the Secure/Non-secure (=1/0) status of addresses
#               matching this region, if this region is enabled.
.equ	DMA_MPU_LAR5_S_RESET, 0x0
.equ	DMA_MPU_LAR5_S_BITS, 0x00000004
.equ	DMA_MPU_LAR5_S_MSB, 2
.equ	DMA_MPU_LAR5_S_LSB, 2
# -----------------------------------------------------------------------------
# Field       : DMA_MPU_LAR5_P
# Description : Determines the Privileged/Unprivileged (=1/0) status of
#               addresses matching this region, if this region is enabled.
#               Writable from any Privileged context, if and only if the S bit
#               is clear. Otherwise, writable only from a Secure, Privileged
#               context.
.equ	DMA_MPU_LAR5_P_RESET, 0x0
.equ	DMA_MPU_LAR5_P_BITS, 0x00000002
.equ	DMA_MPU_LAR5_P_MSB, 1
.equ	DMA_MPU_LAR5_P_LSB, 1
# -----------------------------------------------------------------------------
# Field       : DMA_MPU_LAR5_EN
# Description : Region enable. If 1, any address within range specified by the
#               base address (BAR_ADDR) and limit address (LAR_ADDR) has the
#               attributes specified by S and P.
.equ	DMA_MPU_LAR5_EN_RESET, 0x0
.equ	DMA_MPU_LAR5_EN_BITS, 0x00000001
.equ	DMA_MPU_LAR5_EN_MSB, 0
.equ	DMA_MPU_LAR5_EN_LSB, 0
# =============================================================================
# Register    : DMA_MPU_BAR6
# Description : Base address register for MPU region 6. Writable only from a
#               Secure, Privileged context.
.equ	DMA_MPU_BAR6_OFFSET, 0x00000534
.equ	DMA_MPU_BAR6_BITS, 0xffffffe0
.equ	DMA_MPU_BAR6_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : DMA_MPU_BAR6_ADDR
# Description : This MPU region matches addresses where addr[31:5] (the 27 most
#               significant bits) are greater than or equal to BAR_ADDR, and
#               less than or equal to LAR_ADDR.
#
#               Readable from any Privileged context, if and only if this
#               region's S bit is clear, and MPU_CTRL_NS_HIDE_ADDR is clear.
#               Otherwise readable only from a Secure, Privileged context.
.equ	DMA_MPU_BAR6_ADDR_RESET, 0x0000000
.equ	DMA_MPU_BAR6_ADDR_BITS, 0xffffffe0
.equ	DMA_MPU_BAR6_ADDR_MSB, 31
.equ	DMA_MPU_BAR6_ADDR_LSB, 5
# =============================================================================
# Register    : DMA_MPU_LAR6
# Description : Limit address register for MPU region 6. Writable only from a
#               Secure, Privileged context, with the exception of the P bit.
.equ	DMA_MPU_LAR6_OFFSET, 0x00000538
.equ	DMA_MPU_LAR6_BITS, 0xffffffe7
.equ	DMA_MPU_LAR6_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : DMA_MPU_LAR6_ADDR
# Description : Limit address bits 31:5. Readable from any Privileged context,
#               if and only if this region's S bit is clear, and
#               MPU_CTRL_NS_HIDE_ADDR is clear. Otherwise readable only from a
#               Secure, Privileged context.
.equ	DMA_MPU_LAR6_ADDR_RESET, 0x0000000
.equ	DMA_MPU_LAR6_ADDR_BITS, 0xffffffe0
.equ	DMA_MPU_LAR6_ADDR_MSB, 31
.equ	DMA_MPU_LAR6_ADDR_LSB, 5
# -----------------------------------------------------------------------------
# Field       : DMA_MPU_LAR6_S
# Description : Determines the Secure/Non-secure (=1/0) status of addresses
#               matching this region, if this region is enabled.
.equ	DMA_MPU_LAR6_S_RESET, 0x0
.equ	DMA_MPU_LAR6_S_BITS, 0x00000004
.equ	DMA_MPU_LAR6_S_MSB, 2
.equ	DMA_MPU_LAR6_S_LSB, 2
# -----------------------------------------------------------------------------
# Field       : DMA_MPU_LAR6_P
# Description : Determines the Privileged/Unprivileged (=1/0) status of
#               addresses matching this region, if this region is enabled.
#               Writable from any Privileged context, if and only if the S bit
#               is clear. Otherwise, writable only from a Secure, Privileged
#               context.
.equ	DMA_MPU_LAR6_P_RESET, 0x0
.equ	DMA_MPU_LAR6_P_BITS, 0x00000002
.equ	DMA_MPU_LAR6_P_MSB, 1
.equ	DMA_MPU_LAR6_P_LSB, 1
# -----------------------------------------------------------------------------
# Field       : DMA_MPU_LAR6_EN
# Description : Region enable. If 1, any address within range specified by the
#               base address (BAR_ADDR) and limit address (LAR_ADDR) has the
#               attributes specified by S and P.
.equ	DMA_MPU_LAR6_EN_RESET, 0x0
.equ	DMA_MPU_LAR6_EN_BITS, 0x00000001
.equ	DMA_MPU_LAR6_EN_MSB, 0
.equ	DMA_MPU_LAR6_EN_LSB, 0
# =============================================================================
# Register    : DMA_MPU_BAR7
# Description : Base address register for MPU region 7. Writable only from a
#               Secure, Privileged context.
.equ	DMA_MPU_BAR7_OFFSET, 0x0000053c
.equ	DMA_MPU_BAR7_BITS, 0xffffffe0
.equ	DMA_MPU_BAR7_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : DMA_MPU_BAR7_ADDR
# Description : This MPU region matches addresses where addr[31:5] (the 27 most
#               significant bits) are greater than or equal to BAR_ADDR, and
#               less than or equal to LAR_ADDR.
#
#               Readable from any Privileged context, if and only if this
#               region's S bit is clear, and MPU_CTRL_NS_HIDE_ADDR is clear.
#               Otherwise readable only from a Secure, Privileged context.
.equ	DMA_MPU_BAR7_ADDR_RESET, 0x0000000
.equ	DMA_MPU_BAR7_ADDR_BITS, 0xffffffe0
.equ	DMA_MPU_BAR7_ADDR_MSB, 31
.equ	DMA_MPU_BAR7_ADDR_LSB, 5
# =============================================================================
# Register    : DMA_MPU_LAR7
# Description : Limit address register for MPU region 7. Writable only from a
#               Secure, Privileged context, with the exception of the P bit.
.equ	DMA_MPU_LAR7_OFFSET, 0x00000540
.equ	DMA_MPU_LAR7_BITS, 0xffffffe7
.equ	DMA_MPU_LAR7_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : DMA_MPU_LAR7_ADDR
# Description : Limit address bits 31:5. Readable from any Privileged context,
#               if and only if this region's S bit is clear, and
#               MPU_CTRL_NS_HIDE_ADDR is clear. Otherwise readable only from a
#               Secure, Privileged context.
.equ	DMA_MPU_LAR7_ADDR_RESET, 0x0000000
.equ	DMA_MPU_LAR7_ADDR_BITS, 0xffffffe0
.equ	DMA_MPU_LAR7_ADDR_MSB, 31
.equ	DMA_MPU_LAR7_ADDR_LSB, 5
# -----------------------------------------------------------------------------
# Field       : DMA_MPU_LAR7_S
# Description : Determines the Secure/Non-secure (=1/0) status of addresses
#               matching this region, if this region is enabled.
.equ	DMA_MPU_LAR7_S_RESET, 0x0
.equ	DMA_MPU_LAR7_S_BITS, 0x00000004
.equ	DMA_MPU_LAR7_S_MSB, 2
.equ	DMA_MPU_LAR7_S_LSB, 2
# -----------------------------------------------------------------------------
# Field       : DMA_MPU_LAR7_P
# Description : Determines the Privileged/Unprivileged (=1/0) status of
#               addresses matching this region, if this region is enabled.
#               Writable from any Privileged context, if and only if the S bit
#               is clear. Otherwise, writable only from a Secure, Privileged
#               context.
.equ	DMA_MPU_LAR7_P_RESET, 0x0
.equ	DMA_MPU_LAR7_P_BITS, 0x00000002
.equ	DMA_MPU_LAR7_P_MSB, 1
.equ	DMA_MPU_LAR7_P_LSB, 1
# -----------------------------------------------------------------------------
# Field       : DMA_MPU_LAR7_EN
# Description : Region enable. If 1, any address within range specified by the
#               base address (BAR_ADDR) and limit address (LAR_ADDR) has the
#               attributes specified by S and P.
.equ	DMA_MPU_LAR7_EN_RESET, 0x0
.equ	DMA_MPU_LAR7_EN_BITS, 0x00000001
.equ	DMA_MPU_LAR7_EN_MSB, 0
.equ	DMA_MPU_LAR7_EN_LSB, 0
# =============================================================================
# Register    : DMA_CH0_DBG_CTDREQ
# Description : Read: get channel DREQ counter (i.e. how many accesses the DMA
#               expects it can perform on the peripheral without
#               overflow/underflow. Write any value: clears the counter, and
#               cause channel to re-initiate DREQ handshake.
.equ	DMA_CH0_DBG_CTDREQ_OFFSET, 0x00000800
.equ	DMA_CH0_DBG_CTDREQ_BITS, 0x0000003f
.equ	DMA_CH0_DBG_CTDREQ_RESET, 0x00000000
.equ	DMA_CH0_DBG_CTDREQ_MSB, 5
.equ	DMA_CH0_DBG_CTDREQ_LSB, 0
# =============================================================================
# Register    : DMA_CH0_DBG_TCR
# Description : Read to get channel TRANS_COUNT reload value, i.e. the length
#               of the next transfer
.equ	DMA_CH0_DBG_TCR_OFFSET, 0x00000804
.equ	DMA_CH0_DBG_TCR_BITS, 0xffffffff
.equ	DMA_CH0_DBG_TCR_RESET, 0x00000000
.equ	DMA_CH0_DBG_TCR_MSB, 31
.equ	DMA_CH0_DBG_TCR_LSB, 0
# =============================================================================
# Register    : DMA_CH1_DBG_CTDREQ
# Description : Read: get channel DREQ counter (i.e. how many accesses the DMA
#               expects it can perform on the peripheral without
#               overflow/underflow. Write any value: clears the counter, and
#               cause channel to re-initiate DREQ handshake.
.equ	DMA_CH1_DBG_CTDREQ_OFFSET, 0x00000840
.equ	DMA_CH1_DBG_CTDREQ_BITS, 0x0000003f
.equ	DMA_CH1_DBG_CTDREQ_RESET, 0x00000000
.equ	DMA_CH1_DBG_CTDREQ_MSB, 5
.equ	DMA_CH1_DBG_CTDREQ_LSB, 0
# =============================================================================
# Register    : DMA_CH1_DBG_TCR
# Description : Read to get channel TRANS_COUNT reload value, i.e. the length
#               of the next transfer
.equ	DMA_CH1_DBG_TCR_OFFSET, 0x00000844
.equ	DMA_CH1_DBG_TCR_BITS, 0xffffffff
.equ	DMA_CH1_DBG_TCR_RESET, 0x00000000
.equ	DMA_CH1_DBG_TCR_MSB, 31
.equ	DMA_CH1_DBG_TCR_LSB, 0
# =============================================================================
# Register    : DMA_CH2_DBG_CTDREQ
# Description : Read: get channel DREQ counter (i.e. how many accesses the DMA
#               expects it can perform on the peripheral without
#               overflow/underflow. Write any value: clears the counter, and
#               cause channel to re-initiate DREQ handshake.
.equ	DMA_CH2_DBG_CTDREQ_OFFSET, 0x00000880
.equ	DMA_CH2_DBG_CTDREQ_BITS, 0x0000003f
.equ	DMA_CH2_DBG_CTDREQ_RESET, 0x00000000
.equ	DMA_CH2_DBG_CTDREQ_MSB, 5
.equ	DMA_CH2_DBG_CTDREQ_LSB, 0
# =============================================================================
# Register    : DMA_CH2_DBG_TCR
# Description : Read to get channel TRANS_COUNT reload value, i.e. the length
#               of the next transfer
.equ	DMA_CH2_DBG_TCR_OFFSET, 0x00000884
.equ	DMA_CH2_DBG_TCR_BITS, 0xffffffff
.equ	DMA_CH2_DBG_TCR_RESET, 0x00000000
.equ	DMA_CH2_DBG_TCR_MSB, 31
.equ	DMA_CH2_DBG_TCR_LSB, 0
# =============================================================================
# Register    : DMA_CH3_DBG_CTDREQ
# Description : Read: get channel DREQ counter (i.e. how many accesses the DMA
#               expects it can perform on the peripheral without
#               overflow/underflow. Write any value: clears the counter, and
#               cause channel to re-initiate DREQ handshake.
.equ	DMA_CH3_DBG_CTDREQ_OFFSET, 0x000008c0
.equ	DMA_CH3_DBG_CTDREQ_BITS, 0x0000003f
.equ	DMA_CH3_DBG_CTDREQ_RESET, 0x00000000
.equ	DMA_CH3_DBG_CTDREQ_MSB, 5
.equ	DMA_CH3_DBG_CTDREQ_LSB, 0
# =============================================================================
# Register    : DMA_CH3_DBG_TCR
# Description : Read to get channel TRANS_COUNT reload value, i.e. the length
#               of the next transfer
.equ	DMA_CH3_DBG_TCR_OFFSET, 0x000008c4
.equ	DMA_CH3_DBG_TCR_BITS, 0xffffffff
.equ	DMA_CH3_DBG_TCR_RESET, 0x00000000
.equ	DMA_CH3_DBG_TCR_MSB, 31
.equ	DMA_CH3_DBG_TCR_LSB, 0
# =============================================================================
# Register    : DMA_CH4_DBG_CTDREQ
# Description : Read: get channel DREQ counter (i.e. how many accesses the DMA
#               expects it can perform on the peripheral without
#               overflow/underflow. Write any value: clears the counter, and
#               cause channel to re-initiate DREQ handshake.
.equ	DMA_CH4_DBG_CTDREQ_OFFSET, 0x00000900
.equ	DMA_CH4_DBG_CTDREQ_BITS, 0x0000003f
.equ	DMA_CH4_DBG_CTDREQ_RESET, 0x00000000
.equ	DMA_CH4_DBG_CTDREQ_MSB, 5
.equ	DMA_CH4_DBG_CTDREQ_LSB, 0
# =============================================================================
# Register    : DMA_CH4_DBG_TCR
# Description : Read to get channel TRANS_COUNT reload value, i.e. the length
#               of the next transfer
.equ	DMA_CH4_DBG_TCR_OFFSET, 0x00000904
.equ	DMA_CH4_DBG_TCR_BITS, 0xffffffff
.equ	DMA_CH4_DBG_TCR_RESET, 0x00000000
.equ	DMA_CH4_DBG_TCR_MSB, 31
.equ	DMA_CH4_DBG_TCR_LSB, 0
# =============================================================================
# Register    : DMA_CH5_DBG_CTDREQ
# Description : Read: get channel DREQ counter (i.e. how many accesses the DMA
#               expects it can perform on the peripheral without
#               overflow/underflow. Write any value: clears the counter, and
#               cause channel to re-initiate DREQ handshake.
.equ	DMA_CH5_DBG_CTDREQ_OFFSET, 0x00000940
.equ	DMA_CH5_DBG_CTDREQ_BITS, 0x0000003f
.equ	DMA_CH5_DBG_CTDREQ_RESET, 0x00000000
.equ	DMA_CH5_DBG_CTDREQ_MSB, 5
.equ	DMA_CH5_DBG_CTDREQ_LSB, 0
# =============================================================================
# Register    : DMA_CH5_DBG_TCR
# Description : Read to get channel TRANS_COUNT reload value, i.e. the length
#               of the next transfer
.equ	DMA_CH5_DBG_TCR_OFFSET, 0x00000944
.equ	DMA_CH5_DBG_TCR_BITS, 0xffffffff
.equ	DMA_CH5_DBG_TCR_RESET, 0x00000000
.equ	DMA_CH5_DBG_TCR_MSB, 31
.equ	DMA_CH5_DBG_TCR_LSB, 0
# =============================================================================
# Register    : DMA_CH6_DBG_CTDREQ
# Description : Read: get channel DREQ counter (i.e. how many accesses the DMA
#               expects it can perform on the peripheral without
#               overflow/underflow. Write any value: clears the counter, and
#               cause channel to re-initiate DREQ handshake.
.equ	DMA_CH6_DBG_CTDREQ_OFFSET, 0x00000980
.equ	DMA_CH6_DBG_CTDREQ_BITS, 0x0000003f
.equ	DMA_CH6_DBG_CTDREQ_RESET, 0x00000000
.equ	DMA_CH6_DBG_CTDREQ_MSB, 5
.equ	DMA_CH6_DBG_CTDREQ_LSB, 0
# =============================================================================
# Register    : DMA_CH6_DBG_TCR
# Description : Read to get channel TRANS_COUNT reload value, i.e. the length
#               of the next transfer
.equ	DMA_CH6_DBG_TCR_OFFSET, 0x00000984
.equ	DMA_CH6_DBG_TCR_BITS, 0xffffffff
.equ	DMA_CH6_DBG_TCR_RESET, 0x00000000
.equ	DMA_CH6_DBG_TCR_MSB, 31
.equ	DMA_CH6_DBG_TCR_LSB, 0
# =============================================================================
# Register    : DMA_CH7_DBG_CTDREQ
# Description : Read: get channel DREQ counter (i.e. how many accesses the DMA
#               expects it can perform on the peripheral without
#               overflow/underflow. Write any value: clears the counter, and
#               cause channel to re-initiate DREQ handshake.
.equ	DMA_CH7_DBG_CTDREQ_OFFSET, 0x000009c0
.equ	DMA_CH7_DBG_CTDREQ_BITS, 0x0000003f
.equ	DMA_CH7_DBG_CTDREQ_RESET, 0x00000000
.equ	DMA_CH7_DBG_CTDREQ_MSB, 5
.equ	DMA_CH7_DBG_CTDREQ_LSB, 0
# =============================================================================
# Register    : DMA_CH7_DBG_TCR
# Description : Read to get channel TRANS_COUNT reload value, i.e. the length
#               of the next transfer
.equ	DMA_CH7_DBG_TCR_OFFSET, 0x000009c4
.equ	DMA_CH7_DBG_TCR_BITS, 0xffffffff
