konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/dma.inc
.equ	DMA_CH7_DBG_TCR_RESET, 0x00000000
.equ	DMA_CH7_DBG_TCR_MSB, 31
.equ	DMA_CH7_DBG_TCR_LSB, 0
# =============================================================================
# Register    : DMA_CH8_DBG_CTDREQ
# Description : Read: get channel DREQ counter (i.e. how many accesses the DMA
#               expects it can perform on the peripheral without
#               overflow/underflow. Write any value: clears the counter, and
#               cause channel to re-initiate DREQ handshake.
.equ	DMA_CH8_DBG_CTDREQ_OFFSET, 0x00000a00
.equ	DMA_CH8_DBG_CTDREQ_BITS, 0x0000003f
.equ	DMA_CH8_DBG_CTDREQ_RESET, 0x00000000
.equ	DMA_CH8_DBG_CTDREQ_MSB, 5
.equ	DMA_CH8_DBG_CTDREQ_LSB, 0
# =============================================================================
# Register    : DMA_CH8_DBG_TCR
# Description : Read to get channel TRANS_COUNT reload value, i.e. the length
#               of the next transfer
.equ	DMA_CH8_DBG_TCR_OFFSET, 0x00000a04
.equ	DMA_CH8_DBG_TCR_BITS, 0xffffffff
.equ	DMA_CH8_DBG_TCR_RESET, 0x00000000
.equ	DMA_CH8_DBG_TCR_MSB, 31
.equ	DMA_CH8_DBG_TCR_LSB, 0
# =============================================================================
# Register    : DMA_CH9_DBG_CTDREQ
# Description : Read: get channel DREQ counter (i.e. how many accesses the DMA
#               expects it can perform on the peripheral without
#               overflow/underflow. Write any value: clears the counter, and
#               cause channel to re-initiate DREQ handshake.
.equ	DMA_CH9_DBG_CTDREQ_OFFSET, 0x00000a40
.equ	DMA_CH9_DBG_CTDREQ_BITS, 0x0000003f
.equ	DMA_CH9_DBG_CTDREQ_RESET, 0x00000000
.equ	DMA_CH9_DBG_CTDREQ_MSB, 5
.equ	DMA_CH9_DBG_CTDREQ_LSB, 0
# =============================================================================
# Register    : DMA_CH9_DBG_TCR
# Description : Read to get channel TRANS_COUNT reload value, i.e. the length
#               of the next transfer
.equ	DMA_CH9_DBG_TCR_OFFSET, 0x00000a44
.equ	DMA_CH9_DBG_TCR_BITS, 0xffffffff
.equ	DMA_CH9_DBG_TCR_RESET, 0x00000000
.equ	DMA_CH9_DBG_TCR_MSB, 31
.equ	DMA_CH9_DBG_TCR_LSB, 0
# =============================================================================
# Register    : DMA_CH10_DBG_CTDREQ
# Description : Read: get channel DREQ counter (i.e. how many accesses the DMA
#               expects it can perform on the peripheral without
#               overflow/underflow. Write any value: clears the counter, and
#               cause channel to re-initiate DREQ handshake.
.equ	DMA_CH10_DBG_CTDREQ_OFFSET, 0x00000a80
.equ	DMA_CH10_DBG_CTDREQ_BITS, 0x0000003f
.equ	DMA_CH10_DBG_CTDREQ_RESET, 0x00000000
.equ	DMA_CH10_DBG_CTDREQ_MSB, 5
.equ	DMA_CH10_DBG_CTDREQ_LSB, 0
# =============================================================================
# Register    : DMA_CH10_DBG_TCR
# Description : Read to get channel TRANS_COUNT reload value, i.e. the length
#               of the next transfer
.equ	DMA_CH10_DBG_TCR_OFFSET, 0x00000a84
.equ	DMA_CH10_DBG_TCR_BITS, 0xffffffff
.equ	DMA_CH10_DBG_TCR_RESET, 0x00000000
.equ	DMA_CH10_DBG_TCR_MSB, 31
.equ	DMA_CH10_DBG_TCR_LSB, 0
# =============================================================================
# Register    : DMA_CH11_DBG_CTDREQ
# Description : Read: get channel DREQ counter (i.e. how many accesses the DMA
#               expects it can perform on the peripheral without
#               overflow/underflow. Write any value: clears the counter, and
#               cause channel to re-initiate DREQ handshake.
.equ	DMA_CH11_DBG_CTDREQ_OFFSET, 0x00000ac0
.equ	DMA_CH11_DBG_CTDREQ_BITS, 0x0000003f
.equ	DMA_CH11_DBG_CTDREQ_RESET, 0x00000000
.equ	DMA_CH11_DBG_CTDREQ_MSB, 5
.equ	DMA_CH11_DBG_CTDREQ_LSB, 0
# =============================================================================
# Register    : DMA_CH11_DBG_TCR
# Description : Read to get channel TRANS_COUNT reload value, i.e. the length
#               of the next transfer
.equ	DMA_CH11_DBG_TCR_OFFSET, 0x00000ac4
.equ	DMA_CH11_DBG_TCR_BITS, 0xffffffff
.equ	DMA_CH11_DBG_TCR_RESET, 0x00000000
.equ	DMA_CH11_DBG_TCR_MSB, 31
.equ	DMA_CH11_DBG_TCR_LSB, 0
# =============================================================================
# Register    : DMA_CH12_DBG_CTDREQ
# Description : Read: get channel DREQ counter (i.e. how many accesses the DMA
#               expects it can perform on the peripheral without
#               overflow/underflow. Write any value: clears the counter, and
#               cause channel to re-initiate DREQ handshake.
.equ	DMA_CH12_DBG_CTDREQ_OFFSET, 0x00000b00
.equ	DMA_CH12_DBG_CTDREQ_BITS, 0x0000003f
.equ	DMA_CH12_DBG_CTDREQ_RESET, 0x00000000
.equ	DMA_CH12_DBG_CTDREQ_MSB, 5
.equ	DMA_CH12_DBG_CTDREQ_LSB, 0
# =============================================================================
# Register    : DMA_CH12_DBG_TCR
# Description : Read to get channel TRANS_COUNT reload value, i.e. the length
#               of the next transfer
.equ	DMA_CH12_DBG_TCR_OFFSET, 0x00000b04
.equ	DMA_CH12_DBG_TCR_BITS, 0xffffffff
.equ	DMA_CH12_DBG_TCR_RESET, 0x00000000
.equ	DMA_CH12_DBG_TCR_MSB, 31
.equ	DMA_CH12_DBG_TCR_LSB, 0
# =============================================================================
# Register    : DMA_CH13_DBG_CTDREQ
# Description : Read: get channel DREQ counter (i.e. how many accesses the DMA
#               expects it can perform on the peripheral without
#               overflow/underflow. Write any value: clears the counter, and
#               cause channel to re-initiate DREQ handshake.
.equ	DMA_CH13_DBG_CTDREQ_OFFSET, 0x00000b40
.equ	DMA_CH13_DBG_CTDREQ_BITS, 0x0000003f
.equ	DMA_CH13_DBG_CTDREQ_RESET, 0x00000000
.equ	DMA_CH13_DBG_CTDREQ_MSB, 5
.equ	DMA_CH13_DBG_CTDREQ_LSB, 0
# =============================================================================
# Register    : DMA_CH13_DBG_TCR
# Description : Read to get channel TRANS_COUNT reload value, i.e. the length
#               of the next transfer
.equ	DMA_CH13_DBG_TCR_OFFSET, 0x00000b44
.equ	DMA_CH13_DBG_TCR_BITS, 0xffffffff
.equ	DMA_CH13_DBG_TCR_RESET, 0x00000000
.equ	DMA_CH13_DBG_TCR_MSB, 31
.equ	DMA_CH13_DBG_TCR_LSB, 0
# =============================================================================
# Register    : DMA_CH14_DBG_CTDREQ
# Description : Read: get channel DREQ counter (i.e. how many accesses the DMA
#               expects it can perform on the peripheral without
#               overflow/underflow. Write any value: clears the counter, and
#               cause channel to re-initiate DREQ handshake.
.equ	DMA_CH14_DBG_CTDREQ_OFFSET, 0x00000b80
.equ	DMA_CH14_DBG_CTDREQ_BITS, 0x0000003f
.equ	DMA_CH14_DBG_CTDREQ_RESET, 0x00000000
.equ	DMA_CH14_DBG_CTDREQ_MSB, 5
.equ	DMA_CH14_DBG_CTDREQ_LSB, 0
# =============================================================================
# Register    : DMA_CH14_DBG_TCR
# Description : Read to get channel TRANS_COUNT reload value, i.e. the length
#               of the next transfer
.equ	DMA_CH14_DBG_TCR_OFFSET, 0x00000b84
.equ	DMA_CH14_DBG_TCR_BITS, 0xffffffff
.equ	DMA_CH14_DBG_TCR_RESET, 0x00000000
.equ	DMA_CH14_DBG_TCR_MSB, 31
.equ	DMA_CH14_DBG_TCR_LSB, 0
# =============================================================================
# Register    : DMA_CH15_DBG_CTDREQ
# Description : Read: get channel DREQ counter (i.e. how many accesses the DMA
#               expects it can perform on the peripheral without
#               overflow/underflow. Write any value: clears the counter, and
#               cause channel to re-initiate DREQ handshake.
.equ	DMA_CH15_DBG_CTDREQ_OFFSET, 0x00000bc0
.equ	DMA_CH15_DBG_CTDREQ_BITS, 0x0000003f
.equ	DMA_CH15_DBG_CTDREQ_RESET, 0x00000000
.equ	DMA_CH15_DBG_CTDREQ_MSB, 5
.equ	DMA_CH15_DBG_CTDREQ_LSB, 0
# =============================================================================
# Register    : DMA_CH15_DBG_TCR
# Description : Read to get channel TRANS_COUNT reload value, i.e. the length
#               of the next transfer
.equ	DMA_CH15_DBG_TCR_OFFSET, 0x00000bc4
.equ	DMA_CH15_DBG_TCR_BITS, 0xffffffff
.equ	DMA_CH15_DBG_TCR_RESET, 0x00000000
.equ	DMA_CH15_DBG_TCR_MSB, 31
.equ	DMA_CH15_DBG_TCR_LSB, 0
# =============================================================================
.endif # _HARDWARE_REGS_DMA_H
